[{"url": "http://books.toscrape.com/catalogue/a-light-in-the-attic_1000/index.html", "url_md5": "http://books.toscrape.com/catalogue/a-light-in-the-attic_1000/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/fe/72/fe72f0532301ec28892ae79a629a293c.jpg"], "title": "A Light in the Attic", "description": "It's hard to imagine a world without A Light in the Attic. This now-classic collection of poetry and drawings from Shel Silverstein celebrates its 20th anniversary with this special edition. Silverstein's humorous and creative verse can amuse the dowdiest of readers. Lemon-faced adults and fidgety kids sit still and read these rhythmic words and laugh and smile and love th It's hard to imagine a world without A Light in the Attic. This now-classic collection of poetry and drawings from Shel Silverstein celebrates its 20th anniversary with this special edition. Silverstein's humorous and creative verse can amuse the dowdiest of readers. Lemon-faced adults and fidgety kids sit still and read these rhythmic words and laugh and smile and love that Silverstein. Need proof of his genius? RockabyeRockabye baby, in the treetopDon't you know a treetopIs no safe place to rock?And who put you up there,And your cradle, too?Baby, I think someone down here'sGot it in for you. Shel, you never sounded so good. ...more", "star_rating": 3, "upc": "a897fe39b1053632", "product_type": "Books", "currency": "£", "price_exceltax": 51.77, "price_incltax": 51.77, "tax": 0.0, "availability": 22, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/how-music-works_979/index.html", "url_md5": "http://books.toscrape.com/catalogue/how-music-works_979/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/1d/40/1d4087ff0a63f09fae9cd8433d21c2c4.jpg"], "title": "How Music Works", "description": "How Music Works is David Byrne’s remarkable and buoyant celebration of a subject he has spent a lifetime thinking about. In it he explores how profoundly music is shaped by its time and place, and he explains how the advent of recording technology in the twentieth century forever changed our relationship to playing, performing, and listening to music.Acting as historian an How Music Works is David Byrne’s remarkable and buoyant celebration of a subject he has spent a lifetime thinking about. In it he explores how profoundly music is shaped by its time and place, and he explains how the advent of recording technology in the twentieth century forever changed our relationship to playing, performing, and listening to music.Acting as historian and anthropologist, raconteur and social scientist, he searches for patterns—and shows how those patterns have affected his own work over the years with Talking Heads and his many collaborators, from Brian Eno to Caetano Veloso. Byrne sees music as part of a larger, almost Darwinian pattern of adaptations and responses to its cultural and physical context. His range is panoptic, taking us from Wagnerian opera houses to African villages, from his earliest high school reel-to-reel recordings to his latest work in a home music studio (and all the big studios in between).Touching on the joy, the physics, and even the business of making music, How Music Works is a brainy, irresistible adventure and an impassioned argument about music’s liberating, life-affirming power. ...more", "star_rating": 2, "upc": "327f68a59745c102", "product_type": "Books", "currency": "£", "price_exceltax": 37.32, "price_incltax": 37.32, "tax": 0.0, "availability": 19, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/tipping-the-velvet_999/index.html", "url_md5": "http://books.toscrape.com/catalogue/tipping-the-velvet_999/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/08/e9/08e94f3731d7d6b760dfbfbc02ca5c62.jpg"], "title": "Tipping the Velvet", "description": "\"Erotic and absorbing...Written with starling power.\"--\"The New York Times Book Review \" Nan King, an oyster girl, is captivated by the music hall phenomenon Kitty Butler, a male impersonator extraordinaire treading the boards in Canterbury. Through a friend at the box office, Nan manages to visit all her shows and finally meet her heroine. Soon after, she becomes Kitty's \"Erotic and absorbing...Written with starling power.\"--\"The New York Times Book Review \" Nan King, an oyster girl, is captivated by the music hall phenomenon Kitty Butler, a male impersonator extraordinaire treading the boards in Canterbury. Through a friend at the box office, Nan manages to visit all her shows and finally meet her heroine. Soon after, she becomes Kitty's dresser and the two head for the bright lights of Leicester Square where they begin a glittering career as music-hall stars in an all-singing and dancing double act. At the same time, behind closed doors, they admit their attraction to each other and their affair begins. ...more", "star_rating": 1, "upc": "90fa61229261140a", "product_type": "Books", "currency": "£", "price_exceltax": 53.74, "price_incltax": 53.74, "tax": 0.0, "availability": 20, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/in-her-wake_980/index.html", "url_md5": "http://books.toscrape.com/catalogue/in-her-wake_980/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/27/92/2792ef951651ff1eae40a410cac41e0f.jpg"], "title": "In Her Wake", "description": "A perfect life … until she discovered it wasn’t her own.A tragic family event reveals devastating news that rips apart Bella’s comfortable existence. Embarking on a personal journey to uncover the truth, she faces a series of traumatic discoveries that take her to the ruggedly beautiful Cornish coast, where hidden truths, past betrayals and a 25-year-old mystery threaten n A perfect life … until she discovered it wasn’t her own.A tragic family event reveals devastating news that rips apart Bella’s comfortable existence. Embarking on a personal journey to uncover the truth, she faces a series of traumatic discoveries that take her to the ruggedly beautiful Cornish coast, where hidden truths, past betrayals and a 25-year-old mystery threaten not just her identity, but also her life.Chilling, complex and profoundly moving, In Her Wake is a gripping psychological thriller that questions the nature of family – and reminds us that sometimes the most shocking crimes are committed closest to home. ...more", "star_rating": 1, "upc": "23356462d1320d61", "product_type": "Books", "currency": "£", "price_exceltax": 12.84, "price_incltax": 12.84, "tax": 0.0, "availability": 19, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/slow-states-of-collapse-poems_960/index.html", "url_md5": "http://books.toscrape.com/catalogue/slow-states-of-collapse-poems_960/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/db/ac/dbac3faca8a799824f5725d66c0fcce3.jpg"], "title": "Slow States of Collapse: Poems", "description": "The eagerly anticipated debut from one of Canada’s most exciting new poets In her debut collection, Ashley-Elizabeth Best explores the cultivation of resilience during uncertain and often trying times. It’s a book built around day-to-day conflicts — poems about love, family, grief, power, and longing. Navigating the fault lines of popular culture and traditional poetry to The eagerly anticipated debut from one of Canada’s most exciting new poets In her debut collection, Ashley-Elizabeth Best explores the cultivation of resilience during uncertain and often trying times. It’s a book built around day-to-day conflicts — poems about love, family, grief, power, and longing. Navigating the fault lines of popular culture and traditional poetry to assert that we are all history makers, Slow States of Collapse enters the landscape of personal narrative in an attempt to reconcile life’s little universal griefs.Slow States of Collapse presents a world that is at once menacing and full of wonder and grace. It’s a poetry of “casual cruelty” and “kisses like / puncture wounds,” of “something too tender to touch” and “the threat of an intense beauty.” In this collection, illness confronts bedside manners while a migrant restlessness also paints remarkable portraits of shifting self-image, and in the process the nature of personal and political power is reimagined. ...more", "star_rating": 3, "upc": "b4fd5943413e089a", "product_type": "Books", "currency": "£", "price_exceltax": 57.31, "price_incltax": 57.31, "tax": 0.0, "availability": 17, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/reasons-to-stay-alive_959/index.html", "url_md5": "http://books.toscrape.com/catalogue/reasons-to-stay-alive_959/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/f5/3c/f53c7d21723c860cfbca2b539bc55b8f.jpg"], "title": "Reasons to Stay Alive", "description": "I want life. I want to read it and write it and feel it and live it. I want, for as much of the time as possible in this blink-of-an-eye existence we have, to feel all that can be felt. I hate depression. I am scared of it. Terrified, in fact. But at the same time, it has made me who I am. And if - for me - it is the price of feeling life, it's a price always worth paying. I want life. I want to read it and write it and feel it and live it. I want, for as much of the time as possible in this blink-of-an-eye existence we have, to feel all that can be felt. I hate depression. I am scared of it. Terrified, in fact. But at the same time, it has made me who I am. And if - for me - it is the price of feeling life, it's a price always worth paying.Reasons to Stay Alive is about making the most of your time on earth. In the western world the suicide rate is highest amongst men under the age of 35. Matt Haig could have added to that statistic when, aged 24, he found himself staring at a cliff-edge about to jump off. This is the story of why he didn't, how he recovered and learned to live with anxiety and depression. It's also an upbeat, joyous and very funny exploration of how live better, love better, read better and feel more. ...more", "star_rating": 2, "upc": "c8f7f0cb1abb9cac", "product_type": "Books", "currency": "£", "price_exceltax": 26.41, "price_incltax": 26.41, "tax": 0.0, "availability": 17, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-murder-that-never-was-forensic-instincts-5_939/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-murder-that-never-was-forensic-instincts-5_939/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/29/e0/29e036acd8a6e3daa787ce2bc05bdbbb.jpg"], "title": "The Murder That Never Was (Forensic Instincts #5)", "description": "Given the opportunity, would you assume someone else's identity and leave your old life behind? A serendipitous crossing of paths between Lisa Barnes, a down-on-her-luck job seeker, and Julie Forman, a personal trainer to an Olympic hopeful, forever changes the course of both women's lives. One winds up dead and the other finds herself a fugitive, hiding behind one lie aft Given the opportunity, would you assume someone else's identity and leave your old life behind? A serendipitous crossing of paths between Lisa Barnes, a down-on-her-luck job seeker, and Julie Forman, a personal trainer to an Olympic hopeful, forever changes the course of both women's lives. One winds up dead and the other finds herself a fugitive, hiding behind one lie after another as a cold-blooded killer methodically hunts her. Desperately trying to stay alive, the terrified woman enlists the help of Forensic Instincts, a rogue investigative team that clandestinely operates in the gray area between legal and illegal. Safeguarding their client's deception, Forensic Instincts digs into dangerous territory as they try to find out who's after their client and why. Meanwhile, bodies are piling up in Chicago, New Jersey, and Vermont as a megalomaniacal genius will stop at nothing to eradicate anyone who threatens the success of his medical breakthrough. With an unhinged client and a monstrous criminal enterprise as its adversary, Forensic Instincts is forced into uncharted territory to protect their client and save one of their own from becoming the next corpse. Forensic Instincts is an unorthodox, criminal investigative team that carefully navigates the fine line between legal and illegal. The team consists of a behaviorist, a former Navy SEAL, a techo-wiz, an intuitive, a pickpocket, a retired FBI agent, and a human scent evidence dog.\" ...more", "star_rating": 3, "upc": "d01ac97e2b8947c2", "product_type": "Books", "currency": "£", "price_exceltax": 54.11, "price_incltax": 54.11, "tax": 0.0, "availability": 16, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-nameless-city-the-nameless-city-1_940/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-nameless-city-the-nameless-city-1_940/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/19/de/19deee0778c2406da04a4dd0ea09188f.jpg"], "title": "The Nameless City (The Nameless City #1)", "description": "Every nation that invades the City gives it a new name. But before long, new invaders arrive and the City changes hands once again. The natives don't let themselves get caught up in the unending wars. To them, their home is the Nameless City, and those who try to name it are forever outsiders.Kaidu is one such outsider. He's a Dao born and bred--a member of the latest occu Every nation that invades the City gives it a new name. But before long, new invaders arrive and the City changes hands once again. The natives don't let themselves get caught up in the unending wars. To them, their home is the Nameless City, and those who try to name it are forever outsiders.Kaidu is one such outsider. He's a Dao born and bred--a member of the latest occupying nation. Rat is a native of the Nameless City. At first, she hates Kai for everything he stands for, but his love of his new home may be the one thing that can bring these two unlikely friends together. Let's hope so, because the fate of the Nameless City rests in their hands. ...more", "star_rating": 4, "upc": "7d385d34d12e60ff", "product_type": "Books", "currency": "£", "price_exceltax": 38.16, "price_incltax": 38.16, "tax": 0.0, "availability": 16, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/princess-between-worlds-wide-awake-princess-5_919/index.html", "url_md5": "http://books.toscrape.com/catalogue/princess-between-worlds-wide-awake-princess-5_919/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/db/01/db01b38d3200a5faff4ead42791416e4.jpg"], "title": "Princess Between Worlds (Wide-Awake Princess #5)", "description": "Just as Annie and Liam are busy making plans to travel the world, a witch shows up and gives them a collection of postcards from the Magic Marketplace. Each postcard gives Annie and Liam the opportunity to travel to exotic lands and far-flung kingdoms. What the witch doesn't give them are directions on how to safely return.", "star_rating": 5, "upc": "0e691eda369f4e09", "product_type": "Books", "currency": "£", "price_exceltax": 13.34, "price_incltax": 13.34, "tax": 0.0, "availability": 16, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/princess-jellyfish-2-in-1-omnibus-vol-01-princess-jellyfish-2-in-1-omnibus-1_920/index.html", "url_md5": "http://books.toscrape.com/catalogue/princess-jellyfish-2-in-1-omnibus-vol-01-princess-jellyfish-2-in-1-omnibus-1_920/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/6c/8f/6c8ffe949fb650ba60eff25be1692881.jpg"], "title": "Princess Jellyfish 2-in-1 Omnibus, Vol. 01 (Princess Jellyfish 2-in-1 Omnibus #1)", "description": "THE LONG-AWAITED STORY OF FANGIRLS TAKING ON TOKYO!Special large-size 2-in-1 edition of over 400 pages!\"One of the best anime and manga for beginners. Enthusiasm - geeky and otherwise - is power in Princess Jellyfish. Enthusiasm saves the day and paves the road to the future.\" - Kotaku\"Princess Jellyfish's ambition is simple: to tell a delightful story in a delightful way. THE LONG-AWAITED STORY OF FANGIRLS TAKING ON TOKYO!Special large-size 2-in-1 edition of over 400 pages!\"One of the best anime and manga for beginners. Enthusiasm - geeky and otherwise - is power in Princess Jellyfish. Enthusiasm saves the day and paves the road to the future.\" - Kotaku\"Princess Jellyfish's ambition is simple: to tell a delightful story in a delightful way... It's a pretty deadly one-two punch.\" - Anime News Network\"Loaded with heart, soul, humor and insight.\" - About.comSTINGING BEAUTY Tsukimi Kurashita has a strange fascination with jellyfish. She’s loved them from a young age and has carried that love with her to her new life in the big city of Tokyo. There, she resides in Amamizukan, a safe-haven for girl geeks who regularly gush over a range of things from trains to Japanese dolls. However, a chance meeting at a pet shop has Tsukimi crossing paths with one of the things that the residents of Amamizukan have been desperately trying to avoid—a beautiful and fashionable woman! But there’s much more to this woman than her trendy clothes! This odd encounter is only the beginning of a new and unexpected path for Tsukimi and her friends. ...more", "star_rating": 5, "upc": "0fa6dceead7ce47a", "product_type": "Books", "currency": "£", "price_exceltax": 13.61, "price_incltax": 13.61, "tax": 0.0, "availability": 16, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/i-hate-fairyland-vol-1-madly-ever-after-i-hate-fairyland-compilations-1-5_899/index.html", "url_md5": "http://books.toscrape.com/catalogue/i-hate-fairyland-vol-1-madly-ever-after-i-hate-fairyland-compilations-1-5_899/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/58/e2/58e2097169e92a95d973da420ce7cc98.jpg"], "title": "I Hate Fairyland, Vol. 1: Madly Ever After (I Hate Fairyland (Compilations) #1-5)", "description": "From superstar writer and artist Skottie Young (Rocket Raccoon, Wizard of OZ, Fortunately, The Milk), comes the first volume of an all-new series of adventure and mayhem. An Adventure Time/Alice in Wonderland-style epic that smashes it's cute little face against grown-up, Tank Girl/Deadpool-esque violent madness. Follow Gert, a forty year old woman stuck in a six year olds From superstar writer and artist Skottie Young (Rocket Raccoon, Wizard of OZ, Fortunately, The Milk), comes the first volume of an all-new series of adventure and mayhem. An Adventure Time/Alice in Wonderland-style epic that smashes it's cute little face against grown-up, Tank Girl/Deadpool-esque violent madness. Follow Gert, a forty year old woman stuck in a six year olds body who has been stuck in the magical world of Fairyland for nearly thirty years. Join her and her giant battle-axe on a delightfully blood soaked journey to see who will survive the girl who HATES FAIRYLAND. Collecting Issues #1-5 for only $9.99. \"Skottie Young is an Eisner Award-Winning, New York Times Bestselling cartoonist who has been making comics and children's books for over fifteen years. Books such as Rocket Raccoon, the Wizard of Oz graphic novels, Little Marvel and Fortunately, The Milk have made him a fan favorite, critically-aclaimed writer and artist. Jean-Francios Beaulieu is the colorist behind the award-winning Wizard of OZ graphic graphic novels and has worked with Skottie Young for over ten years. Nate Piekos is an award-winning letter and designer who has created some of the industry's most popular fons and has used them to letter comic books for Marvel, DC, Oni Press, Dark Horse and many more.\" ...more", "star_rating": 2, "upc": "8d4eefad7a2b3915", "product_type": "Books", "currency": "£", "price_exceltax": 29.17, "price_incltax": 29.17, "tax": 0.0, "availability": 16, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/immunity-how-elie-metchnikoff-changed-the-course-of-modern-medicine_900/index.html", "url_md5": "http://books.toscrape.com/catalogue/immunity-how-elie-metchnikoff-changed-the-course-of-modern-medicine_900/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/e1/1e/e11e7e9514a123aee2415a1def85e638.jpg"], "title": "Immunity: How Elie Metchnikoff Changed the Course of Modern Medicine", "description": "Around Christmas of 1882, while peering through a microscope at starfish larvae in which he had inserted tiny thorns, Russian zoologist Elie Metchnikoff had a brilliant insight: what if the mobile cells he saw gathering around the thorns were nothing but a healing force in action? Metchnikoff’s daring theory of immunity—that voracious cells he called phagocytes formed the Around Christmas of 1882, while peering through a microscope at starfish larvae in which he had inserted tiny thorns, Russian zoologist Elie Metchnikoff had a brilliant insight: what if the mobile cells he saw gathering around the thorns were nothing but a healing force in action? Metchnikoff’s daring theory of immunity—that voracious cells he called phagocytes formed the first line of defense against invading bacteria—would eventually earn the scientist a Nobel Prize, shared with his archrival, as well as the unofficial m oniker “Father of Natural Immunity.” But first he had to win over skeptics, especially those who called his theory “an oriental fairy tale.” Using previously inaccessible archival materials, author Luba Vikhanski chronicles Metchnikoff’s remarkable life and discoveries in the first moder n biography of this hero of medicine. Metchnikoff was a towering figure in the scientific community of the early twentieth century, a tireless humanitarian who, while working at the Pasteur Institute in Paris, also strived to curb the spread of cholera, syphilis, and other deadly diseases. In his later years, he startled the world with controversial theories on longevity, launching a global craze for yogurt, and pioneered research into gut microbes and aging. Though Metchnikoff was largely forgotten for nearly a hundred years, Vikhanski documents a remarkable revival of interest in his ideas on immunity and on the gut flora in the science of the twenty-first century. ...more", "star_rating": 5, "upc": "e4f74c16de34d440", "product_type": "Books", "currency": "£", "price_exceltax": 57.36, "price_incltax": 57.36, "tax": 0.0, "availability": 16, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/algorithms-to-live-by-the-computer-science-of-human-decisions_880/index.html", "url_md5": "http://books.toscrape.com/catalogue/algorithms-to-live-by-the-computer-science-of-human-decisions_880/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/28/ea/28ea530a8b7955e422df64beaed7871a.jpg"], "title": "Algorithms to Live By: The Computer Science of Human Decisions", "description": "A fascinating exploration of how insights from computer algorithms can be applied to our everyday lives, helping to solve common decision-making problems and illuminate the workings of the human mindAll our lives are constrained by limited space and time, limits that give rise to a particular set of problems. What should we do, or leave undone, in a day or a lifetime? How A fascinating exploration of how insights from computer algorithms can be applied to our everyday lives, helping to solve common decision-making problems and illuminate the workings of the human mindAll our lives are constrained by limited space and time, limits that give rise to a particular set of problems. What should we do, or leave undone, in a day or a lifetime? How much messiness should we accept? What balance of new activities and familiar favorites is the most fulfilling? These may seem like uniquely human quandaries, but they are not: computers, too, face the same constraints, so computer scientists have been grappling with their version of such issues for decades. And the solutions they've found have much to teach us.In a dazzlingly interdisciplinary work, acclaimed author Brian Christian and cognitive scientist Tom Griffiths show how the algorithms used by computers can also untangle very human questions. They explain how to have better hunches and when to leave things to chance, how to deal with overwhelming choices and how best to connect with others. From finding a spouse to finding a parking spot, from organizing one's inbox to understanding the workings of memory, Algorithms to Live By transforms the wisdom of computer science into strategies for human living. ...more", "star_rating": 1, "upc": "38d45839cb1c83c1", "product_type": "Books", "currency": "£", "price_exceltax": 30.81, "price_incltax": 30.81, "tax": 0.0, "availability": 16, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/a-world-of-flavor-your-gluten-free-passport_879/index.html", "url_md5": "http://books.toscrape.com/catalogue/a-world-of-flavor-your-gluten-free-passport_879/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/0a/6a/0a6a53a8d37584a7906d2d5a0032f9c1.jpg"], "title": "A World of Flavor: Your Gluten Free Passport", "description": "Trade Review:A World of Flavor, Recipes to Please All of Your GuestsThe new gluten-free cookbook \"A World of Flavor\" is clearly a labor of love for its authors, Amber Barrett and Nancy Miller. Amber is also a gifted photographer, and the photographs in this book could be the best of any cookbook I've ever seen.On top of this, the book includes some amazing recipes that eve Trade Review:A World of Flavor, Recipes to Please All of Your GuestsThe new gluten-free cookbook \"A World of Flavor\" is clearly a labor of love for its authors, Amber Barrett and Nancy Miller. Amber is also a gifted photographer, and the photographs in this book could be the best of any cookbook I've ever seen.On top of this, the book includes some amazing recipes that everyone will like, including: Hot Wings, Bacon and Cheddar Scones, Donuts, Sandwich Bread, Rocky Road Brownies, Crepes, General Tso's Chicken, Croutons, and many more (I counted 77).From breakfasts, appetizers, desserts, main dishes and snacks, to salads, vegetables, and side dishes, this outstanding gluten-free cookbook has much to offer anyone who is on a gluten-free diet.Written by celiac.com April 2016.Mongolian Beef, Cuban Pork, Baked Alaska, French Crepes—if international cuisine gets your taste buds dancing, this the cookbook for you!Travel the world gluten free with mother and daughter authors Nancy Miller and Amber Barrett and their new cookbook, A World of Flavor: Your Gluten-Free Passport.This cookbook provides readers with an inspired combination of dishes from around the globe that are deliciously high in flavor with none of the gluten. These recipes do not rely on pricey cup-for-cup flour alternatives, but use a variety of flours tailored to the success of each individual recipe so you get results to be proud of. ...more", "star_rating": 1, "upc": "70ed59f194b3c556", "product_type": "Books", "currency": "£", "price_exceltax": 42.95, "price_incltax": 42.95, "tax": 0.0, "availability": 16, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-secret-the-secret-1_859/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-secret-the-secret-1_859/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/d3/70/d37038f81b8ad0342346951271c31e58.jpg"], "title": "The Secret (The Secret #1)", "description": "Fragments of a Great Secret have been found in the oral traditions, in literature, in religions and philosophies throughout the centuries. For the first time, all the pieces of The Secret come together in an incredible revelation that will be life-transforming for all who experience it. In this book, you'll learn how to use The Secret in every aspect of your life -- money Fragments of a Great Secret have been found in the oral traditions, in literature, in religions and philosophies throughout the centuries. For the first time, all the pieces of The Secret come together in an incredible revelation that will be life-transforming for all who experience it. In this book, you'll learn how to use The Secret in every aspect of your life -- money, health, relationships, happiness, and in every interaction you have in the world. You'll begin to understand the hidden, untapped power that's within you, and this revelation can bring joy to every aspect of your life. The Secret contains wisdom from modern-day teachers -- men and women who have used it to achieve health, wealth, and happiness. By applying the knowledge of The Secret, they bring to light compelling stories of eradicating disease, acquiring massive wealth, overcoming obstacles, and achieving what many would regard as impossible. ...more", "star_rating": 4, "upc": "961f18db4f138211", "product_type": "Books", "currency": "£", "price_exceltax": 27.37, "price_incltax": 27.37, "tax": 0.0, "availability": 15, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-shadow-hero-the-shadow-hero_860/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-shadow-hero-the-shadow-hero_860/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/c3/d2/c3d2356443efca9bcad78eba8d249fc1.jpg"], "title": "The Shadow Hero (The Shadow Hero)", "description": "A VIBRANT HOMAGE TO A CLASSIC COMIC FROM TWO MASTERS OF THE MODERN GRAPHIC NOVEL. The Shadow Hero is based on golden-age comic series The Green Turtle, whose hero solved crimes and fought injustice just like any other comics hero. But this mysterious masked crusader was hiding more than your run-of-the-mill secret identity...The Green Turtle was the first Asian American su A VIBRANT HOMAGE TO A CLASSIC COMIC FROM TWO MASTERS OF THE MODERN GRAPHIC NOVEL. The Shadow Hero is based on golden-age comic series The Green Turtle, whose hero solved crimes and fought injustice just like any other comics hero. But this mysterious masked crusader was hiding more than your run-of-the-mill secret identity...The Green Turtle was the first Asian American superhero.Now, exactly seventy years later, New York Times-bestselling author Gene Luen Yang has revived this nearly forgotten, pioneering character in a new graphic novel that creates an origin story for the golden-age Green Turtle. With artwork by the unmatched Sonny Liew, this hilarious and insightful graphic novel about heroism and heritage is also a loving tribute to the long, rich tradition of American superhero comics. ...more", "star_rating": 1, "upc": "d6361d16212664ed", "product_type": "Books", "currency": "£", "price_exceltax": 33.14, "price_incltax": 33.14, "tax": 0.0, "availability": 15, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-bridge-to-consciousness-im-writing-the-bridge-between-science-and-our-old-and-new-beliefs_840/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-bridge-to-consciousness-im-writing-the-bridge-between-science-and-our-old-and-new-beliefs_840/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/39/c7/39c7bebcde5d9643ede71ac8ee87ee69.jpg"], "title": "The Bridge to Consciousness: I'm Writing the Bridge Between Science and Our Old and New Beliefs.", "star_rating": 3, "upc": "efc3768127714ec3", "product_type": "Books", "currency": "£", "price_exceltax": 32.0, "price_incltax": 32.0, "tax": 0.0, "availability": 15, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-artists-way-a-spiritual-path-to-higher-creativity_839/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-artists-way-a-spiritual-path-to-higher-creativity_839/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/3b/41/3b414b6d0340a0cbbd05be0942ddaada.jpg"], "title": "The Artist's Way: A Spiritual Path to Higher Creativity", "description": "\"Without The Artist's Way, there would have been no Eat, Pray, Love.” —Elizabeth GilbertThe Artist’s Way is the seminal book on the subject of creativity. An international bestseller, millions of readers have found it to be an invaluable guide to living the artist’s life. Still as vital today—or perhaps even more so—than it was when it was first published one decade ago, i \"Without The Artist's Way, there would have been no Eat, Pray, Love.” —Elizabeth GilbertThe Artist’s Way is the seminal book on the subject of creativity. An international bestseller, millions of readers have found it to be an invaluable guide to living the artist’s life. Still as vital today—or perhaps even more so—than it was when it was first published one decade ago, it is a powerfully provocative and inspiring work. In a new introduction to the book, Julia Cameron reflects upon the impact of The Artist’s Way and describes the work she has done during the last decade and the new insights into the creative process that she has gained. Updated and expanded, this anniversary edition reframes The Artist’s Way for a new century. ...more", "star_rating": 5, "upc": "dd047728de72ad62", "product_type": "Books", "currency": "£", "price_exceltax": 38.49, "price_incltax": 38.49, "tax": 0.0, "availability": 15, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/modern-romance_820/index.html", "url_md5": "http://books.toscrape.com/catalogue/modern-romance_820/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/78/cb/78cb28a3e8804131e8e0c3f7b8deb2fc.jpg"], "title": "Modern Romance", "description": "Now a New York Times BestsellerA hilarious, thoughtful, and in-depth exploration of thepleasures and perils of modern romance from one of this generation’s sharpest comedic voicesAt some point, every one of us embarks on a journey to find love. We meet people, date, getinto and out of relationships, all with the hopeof finding someone with whom we share a deepconnection. T Now a New York Times BestsellerA hilarious, thoughtful, and in-depth exploration of the pleasures and perils of modern romance from one of this generation’s sharpest comedic voicesAt some point, every one of us embarks on a journey to find love. We meet people, date, get into and out of relationships, all with the hope of finding someone with whom we share a deep connection. This seems standard now, but it’s wildly different from what people did even just decades ago. Single people today have more romantic options than at any point in human history. With technology, our abilities to connect with and sort through these options are staggering. So why are so many people frustrated?Some of our problems are unique to our time. “Why did this guy just text me an emoji of a pizza?” “Should I go out with this girl even though she listed Combos as one of her favorite snack foods? Combos?!” “My girlfriend just got a message from some dude named Nathan. Who’s Nathan? Did he just send her a photo of his penis? Should I check just to be sure?” But the transformation of our romantic lives can’t be explained by technology alone. In a short period of time, the whole culture of finding love has changed dramatically. A few decades ago, people would find a decent person who lived in their neighborhood. Their families would meet and, after deciding neither party seemed like a murderer, they would get married and soon have a kid, all by the time they were twenty-four. Today, people marry later than ever and spend years of their lives on a quest to find the perfect person, a soul mate.For years, Aziz Ansari has been aiming his comic insight at modern romance, but for Modern Romance, the book, he decided he needed to take things to another level. He teamed up with NYU sociologist Eric Klinenberg and designed a massive research project, including hundreds of interviews and focus groups conducted everywhere from Tokyo to Buenos Aires to Wichita. They analyzed behavioral data and surveys and created their own online research forum on Reddit, which drew thousands of messages. They enlisted the world’s leading social scientists, including Andrew Cherlin, Eli Finkel, Helen Fisher, Sheena Iyengar, Barry Schwartz, Sherry Turkle, and Robb Willer. The result is unlike any social science or humor book we’ve seen before.In Modern Romance, Ansari combines his irreverent humor with cutting-edge social science to give us an unforgettable tour of our new romantic world. ...more", "star_rating": 5, "upc": "caf4fe9311f1dc59", "product_type": "Books", "currency": "£", "price_exceltax": 28.26, "price_incltax": 28.26, "tax": 0.0, "availability": 15, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/miss-peregrines-home-for-peculiar-children-miss-peregrines-peculiar-children-1_819/index.html", "url_md5": "http://books.toscrape.com/catalogue/miss-peregrines-home-for-peculiar-children-miss-peregrines-peculiar-children-1_819/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/1d/ae/1dae4577eb25fcec3f88e4cbb3fc726a.jpg"], "title": "Miss Peregrine’s Home for Peculiar Children (Miss Peregrine’s Peculiar Children #1)", "description": "A mysterious island. An abandoned orphanage. A strange collection of curious photographs.A horrific family tragedy sets sixteen-year-old Jacob journeying to a remote island off the coast of Wales, where he discovers the crumbling ruins of Miss Peregrine’s Home for Peculiar Children. As Jacob explores its abandoned bedrooms and hallways, it becomes clear that the children w A mysterious island. An abandoned orphanage. A strange collection of curious photographs.A horrific family tragedy sets sixteen-year-old Jacob journeying to a remote island off the coast of Wales, where he discovers the crumbling ruins of Miss Peregrine’s Home for Peculiar Children. As Jacob explores its abandoned bedrooms and hallways, it becomes clear that the children were more than just peculiar. They may have been dangerous. They may have been quarantined on a deserted island for good reason. And somehow—impossible though it seems—they may still be alive.A spine-tingling fantasy illustrated with haunting vintage photography, Miss Peregrine's Home for Peculiar Children will delight adults, teens, and anyone who relishes an adventure in the shadows.~ ...more", "star_rating": 1, "upc": "af96613fdd793a3c", "product_type": "Books", "currency": "£", "price_exceltax": 10.76, "price_incltax": 10.76, "tax": 0.0, "availability": 15, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/daring-greatly-how-the-courage-to-be-vulnerable-transforms-the-way-we-live-love-parent-and-lead_799/index.html", "url_md5": "http://books.toscrape.com/catalogue/daring-greatly-how-the-courage-to-be-vulnerable-transforms-the-way-we-live-love-parent-and-lead_799/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/38/ea/38ea04e1e16ebef78fd2595771fe2287.jpg"], "title": "Daring Greatly: How the Courage to Be Vulnerable Transforms the Way We Live, Love, Parent, and Lead", "description": "Researcher and thought leader Dr. Brené Brown offers a powerful new vision that encourages us to dare greatly: to embrace vulnerability and imperfection, to live wholeheartedly, and to courageously engage in our lives. “It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit Researcher and thought leader Dr. Brené Brown offers a powerful new vision that encourages us to dare greatly: to embrace vulnerability and imperfection, to live wholeheartedly, and to courageously engage in our lives. “It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; . . . who at best knows in the end the triumph of high achievement, and who at worst, if he fails, at least fails while daring greatly.” —Theodore RooseveltEvery day we experience the uncertainty, risks, and emotional exposure that define what it means to be vulnerable, or to dare greatly. Whether the arena is a new relationship, an important meeting, our creative process, or a difficult family conversation, we must find the courage to walk into vulnerability and engage with our whole hearts.In Daring Greatly, Dr. Brown challenges everything we think we know about vulnerability. Based on twelve years of research, she argues that vulnerability is not weakness, but rather our clearest path to courage, engagement, and meaningful connection. The book that Dr. Brown’s many fans have been waiting for, Daring Greatly will spark a new spirit of truth—and trust—in our organizations, families, schools, and communities. ...more", "star_rating": 3, "upc": "3b9a3b4624b7fd6d", "product_type": "Books", "currency": "£", "price_exceltax": 19.43, "price_incltax": 19.43, "tax": 0.0, "availability": 15, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/dark-notes_800/index.html", "url_md5": "http://books.toscrape.com/catalogue/dark-notes_800/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/1c/88/1c8807c42be085f3b061fe63f62a3c39.jpg"], "title": "Dark Notes", "description": "They call me a slut. Maybe I am.Sometimes I do things I despise.Sometimes men take without asking.But I have a musical gift, only a year left of high school, and a plan.With one obstacle.Emeric Marceaux doesn’t just take.He seizes my will power and bangs it like a dark note.When he commands me to play, I want to give him everything.I kneel for his punishments, tremble for They call me a slut. Maybe I am.Sometimes I do things I despise.Sometimes men take without asking.But I have a musical gift, only a year left of high school, and a plan.With one obstacle.Emeric Marceaux doesn’t just take.He seizes my will power and bangs it like a dark note.When he commands me to play, I want to give him everything.I kneel for his punishments, tremble for his touch, and risk it all for our stolen moments.He’s my obsession, my master, my music.And my teacher. ...more", "star_rating": 5, "upc": "88c21fcd38e2486e", "product_type": "Books", "currency": "£", "price_exceltax": 19.19, "price_incltax": 19.19, "tax": 0.0, "availability": 15, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/whats-it-like-in-space-stories-from-astronauts-whove-been-there_779/index.html", "url_md5": "http://books.toscrape.com/catalogue/whats-it-like-in-space-stories-from-astronauts-whove-been-there_779/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/96/6f/966f1fe13d231041bb516c281a675646.jpg"], "title": "What's It Like in Space?: Stories from Astronauts Who've Been There", "description": "Everyone wonders what it's really like in space, but very few of us have ever had the chance to experience it firsthand. This captivating illustrated collection brings together stories from dozens of international astronauts—men and women who've actually been there—who have returned with accounts of the sometimes weird, often funny, and awe-inspiring sensations and realiti Everyone wonders what it's really like in space, but very few of us have ever had the chance to experience it firsthand. This captivating illustrated collection brings together stories from dozens of international astronauts—men and women who've actually been there—who have returned with accounts of the sometimes weird, often funny, and awe-inspiring sensations and realities of being in space. With playful artwork accompanying each, here are the real stories behind backwards dreams, \"moon face,\" the tricks of sleeping in zero gravity and aiming your sneeze during a spacewalk, the importance of packing hot sauce, and dozens of other cosmic quirks and amazements that come with travel in and beyond low Earth orbit. ...more", "star_rating": 2, "upc": "6fd646a334e6e133", "product_type": "Books", "currency": "£", "price_exceltax": 19.6, "price_incltax": 19.6, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/whole-lotta-creativity-going-on-60-fun-and-unusual-exercises-to-awaken-and-strengthen-your-creativity_780/index.html", "url_md5": "http://books.toscrape.com/catalogue/whole-lotta-creativity-going-on-60-fun-and-unusual-exercises-to-awaken-and-strengthen-your-creativity_780/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/e3/d5/e3d59328474571d53aad7d07144e2ef0.jpg"], "title": "Whole Lotta Creativity Going On: 60 Fun and Unusual Exercises to Awaken and Strengthen Your Creativity", "description": "Be your own kind of creative. Everyone has a creative core. Everyone! But, in order for it to thrive, it needs to be nurtured. That's where \"Whole Lotta Creativity Going On\" can help. It's not a crafts or how-to book, but rather a fun book, filled with 10 different types of unusual and thought-provoking activities and exercises, which can be used to ignite and invigorate y Be your own kind of creative. Everyone has a creative core. Everyone! But, in order for it to thrive, it needs to be nurtured. That's where \"Whole Lotta Creativity Going On\" can help. It's not a crafts or how-to book, but rather a fun book, filled with 10 different types of unusual and thought-provoking activities and exercises, which can be used to ignite and invigorate your creative spark. Sometimes, those that don't feel they are creative, surprise themselves the most when they unlock the door, clear away the dust, and begin to discover and unleash the creative side of themselves. For others, perhaps, their creative spirit hasn't been given enough of an opportunity to really flourish and express itself in its own unique way.This book contains 60 different creativity stretchers to get you going which are grouped into the following categories: - Awareness, Sensory, and Experience - Creativity in Action- Ideation- Imagination- Pictures, Patterns, and Abstractions- Snap Portraits- Snap Solutions- Stop and Reflect- Thought Expression- Word Play ...more", "star_rating": 4, "upc": "44a10f1ac8ce822e", "product_type": "Books", "currency": "£", "price_exceltax": 38.2, "price_incltax": 38.2, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-power-of-habit-why-we-do-what-we-do-in-life-and-business_760/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-power-of-habit-why-we-do-what-we-do-in-life-and-business_760/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/03/be/03beffe578a7839374f7060639ce914d.jpg"], "title": "The Power of Habit: Why We Do What We Do in Life and Business", "description": "A young woman walks into a laboratory. Over the past two years, she has transformed almost every aspect of her life. She has quit smoking, run a marathon, and been promoted at work. The patterns inside her brain, neurologists discover, have fundamentally changed.Marketers at Procter & Gamble study videos of people making their beds. They are desperately trying to figur A young woman walks into a laboratory. Over the past two years, she has transformed almost every aspect of her life. She has quit smoking, run a marathon, and been promoted at work. The patterns inside her brain, neurologists discover, have fundamentally changed. Marketers at Procter & Gamble study videos of people making their beds. They are desperately trying to figure out how to sell a new product called Febreze, on track to be one of the biggest flops in company history. Suddenly, one of them detects a nearly imperceptible pattern—and with a slight shift in advertising, Febreze goes on to earn a billion dollars a year. An untested CEO takes over one of the largest companies in America. His first order of business is attacking a single pattern among his employees—how they approach worker safety—and soon the firm, Alcoa, becomes the top performer in the Dow Jones. What do all these people have in common? They achieved success by focusing on the patterns that shape every aspect of our lives.  They succeeded by transforming habits. In The Power of Habit, award-winning New York Times business reporter Charles Duhigg takes us to the thrilling edge of scientific discoveries that explain why habits exist and how they can be changed. With penetrating intelligence and an ability to distill vast amounts of information into engrossing narratives, Duhigg brings to life a whole new understanding of human nature and its potential for transformation.  Along the way we learn why some people and companies struggle to change, despite years of trying, while others seem to remake themselves overnight. We visit laboratories where neuroscientists explore how habits work and where, exactly, they reside in our brains. We discover how the right habits were crucial to the success of Olympic swimmer Michael Phelps, Starbucks CEO Howard Schultz, and civil-rights hero Martin Luther King, Jr. We go inside Procter & Gamble, Target superstores, Rick Warren’s Saddleback Church, NFL locker rooms, and the nation’s largest hospitals and see how implementing so-called keystone habits can earn billions and mean the difference between failure and success, life and death. At its core, The Power of Habit contains an exhilarating argument: The key to exercising regularly, losing weight, raising exceptional children, becoming more productive, building revolutionary companies and social movements, and achieving success is understanding how habits work.  Habits aren’t destiny. As Charles Duhigg shows, by harnessing this new science, we can transform our businesses, our communities, and our lives. ...more", "star_rating": 3, "upc": "6bdd909329435e80", "product_type": "Books", "currency": "£", "price_exceltax": 16.88, "price_incltax": 16.88, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-marriage-of-opposites_759/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-marriage-of-opposites_759/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/33/8e/338e196723f3fb10d5c6990fe54be61d.jpg"], "title": "The Marriage of Opposites", "description": "From the New York Times bestselling author of The Dovekeepers and The Museum of Extraordinary Things: a forbidden love story set on the tropical island of St. Thomas about the extraordinary woman who gave birth to painter Camille Pissarro; the Father of Impressionism.Growing up on idyllic St. Thomas in the early 1800s, Rachel dreams of life in faraway Paris. Rachel's mothe From the New York Times bestselling author of The Dovekeepers and The Museum of Extraordinary Things: a forbidden love story set on the tropical island of St. Thomas about the extraordinary woman who gave birth to painter Camille Pissarro; the Father of Impressionism.Growing up on idyllic St. Thomas in the early 1800s, Rachel dreams of life in faraway Paris. Rachel's mother, a pillar of their small refugee community of Jews who escaped the Inquisition, has never forgiven her daughter for being a difficult girl who refuses to live by the rules. Growing up, Rachel's salvation is their maid Adelle's belief in her strengths, and her deep, life-long friendship with Jestine, Adelle's daughter. But Rachel's life is not her own. She is married off to a widower with three children to save her father's business. When her husband dies suddenly and his handsome, much younger nephew, Fréderick, arrives from France to settle the estate, Rachel seizes her own life story, beginning a defiant, passionate love affair that sparks a scandal that affects all of her family, including her favorite son, who will become one of the greatest artists of France.Building on the triumphs of The Dovekeepers and The Museum of Extraordinary Things, set in a world of almost unimaginable beauty, The Marriage of Opposites showcases the beloved, bestselling Alice Hoffman at the height of her considerable powers. Once forgotten to history, the marriage of Rachel and Fréderick is a story that is as unforgettable as it is remarkable. ...more", "star_rating": 4, "upc": "52cf2a5933ec5d8f", "product_type": "Books", "currency": "£", "price_exceltax": 28.08, "price_incltax": 28.08, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/swell-a-year-of-waves_740/index.html", "url_md5": "http://books.toscrape.com/catalogue/swell-a-year-of-waves_740/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/7d/a6/7da658ca2d3fce1a9958fb754a179ba8.jpg"], "title": "Swell: A Year of Waves", "description": "Wave watchers around the world know that no two waves are the same. Yet each and every wave that rises, peaks, and crashes onto the beach is generated by a much larger force originating thousands of miles away. Surf journalist team Evan Slater and Peter Taras capture the essence of waves and the swells that produce them in this breathtaking collection of wave photography. Wave watchers around the world know that no two waves are the same. Yet each and every wave that rises, peaks, and crashes onto the beach is generated by a much larger force originating thousands of miles away. Surf journalist team Evan Slater and Peter Taras capture the essence of waves and the swells that produce them in this breathtaking collection of wave photography. Slater characterizes four distinct swells from different corners of the globe and traces their journeys throughout the year from storm to seashore. His reflective, informative essays amplify these powerful images of hundreds of waves frozen in time, beautiful, simple, universal, yet wholly unique—and the best thing to watch on the planet. ...more", "star_rating": 1, "upc": "4c8b7540409da4ac", "product_type": "Books", "currency": "£", "price_exceltax": 45.58, "price_incltax": 45.58, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/superman-vol-1-before-truth-superman-by-gene-luen-yang-1_739/index.html", "url_md5": "http://books.toscrape.com/catalogue/superman-vol-1-before-truth-superman-by-gene-luen-yang-1_739/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/31/32/3132ce8535ec612bf8588a5bc62998d4.jpg"], "title": "Superman Vol. 1: Before Truth (Superman by Gene Luen Yang #1)", "description": "Superman is going through some changes. First, there's his new \"solar flare\" power, which releases tremendous amounts of energy but leaves him functionally human - fragile, vulnerable, prone to hangovers - for 24 hours.But an even bigger change is coming. A new company called Hordr has sprung up, and its business is secrets. If you have one that you want to keep hidden, Hr Superman is going through some changes. First, there's his new \"solar flare\" power, which releases tremendous amounts of energy but leaves him functionally human - fragile, vulnerable, prone to hangovers - for 24 hours.But an even bigger change is coming. A new company called Hordr has sprung up, and its business is secrets. If you have one that you want to keep hidden, Hrdr can control you - and no one has a bigger secret than Clark Kent.Now, Hordr is threatening to expose Clark's alter ego unless he does everything they command. Will Superman play into the hands of blackmailers to keep his loved ones out of danger? And if the truth that Superman has been hiding is exposed, will it set him free - or ruin his life?A new era for the Man of Steel begins here - crafted by National Book Award nominee Gene Luen Yang (American Born Chinese) and legendary artists John Romita Jr. (Kick-Ass, The Amazing Spider-Man) and Klaus Janson (BATMAN: THE DARK KNIGHT RETURNS). Collects issues #40-44 and the 8-page Superman story from DIVERGENCE: FCBD SPECIAL EDITION #1. ...more", "star_rating": 5, "upc": "ac8e3949d284e9a9", "product_type": "Books", "currency": "£", "price_exceltax": 11.89, "price_incltax": 11.89, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/my-mrs-brown_719/index.html", "url_md5": "http://books.toscrape.com/catalogue/my-mrs-brown_719/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/2d/a3/2da3464fa2010bebedfba9eca77e42be.jpg"], "title": "My Mrs. Brown", "description": "From William Norwich, the well-known fashion writer and editor, an unforgettable novel about a woman with a secret who travels to New York City on a determined quest to buy a special dress that represents everything she wants to say about that secret…and herself.Sometimes a dress isn’t just a dress.Emilia Brown is a woman of a certain age. She has spent a frugal, useful, a From William Norwich, the well-known fashion writer and editor, an unforgettable novel about a woman with a secret who travels to New York City on a determined quest to buy a special dress that represents everything she wants to say about that secret…and herself.Sometimes a dress isn’t just a dress.Emilia Brown is a woman of a certain age. She has spent a frugal, useful, and wholly restrained life in Ashville, a small town in Rhode Island. Overlooked especially by the industries of fashion and media, Mrs. Brown is one of today’s silent generations of women whose quiet no-frills existences would make them seem invisible. She is a genteel woman who has known her share of personal sorrows and quietly carried on, who makes a modest living cleaning and running errands at the local beauty parlor, who delights in evening chats with her much younger neighbor, twenty-three-year-old Alice Danvers.When the grand dame of Ashville passes away, Mrs. Brown is called upon to inventory her estate and comes across a dress that changes everything. This isn’t a Cinderella confection; it’s a simple yet exquisitely tailored Oscar de la Renta sheath and jacket—a suit that Mrs. Brown realizes, with startling clarity, will say everything she has ever wished to convey. She must have it. And so Mrs. Brown begins her odyssey to purchase the dress. For not only is the owning of the Oscar de la Renta a must, the intimidating trip to purchase it on Madison Avenue is essential as well. If the dress is to give Mrs. Brown a voice, then she must prepare by making the daunting journey—both to the emerald city and within herself.Timeless, poignant, and appealing, My Mrs. Brown is a novel for every mother in the world, every woman who ever wanted the perfect dress, and every child who wanted to give it to her. ...more", "star_rating": 3, "upc": "cc82685d9f49bc2c", "product_type": "Books", "currency": "£", "price_exceltax": 24.48, "price_incltax": 24.48, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/my-name-is-lucy-barton_720/index.html", "url_md5": "http://books.toscrape.com/catalogue/my-name-is-lucy-barton_720/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/28/db/28db43984c765a1d02fd3495f5c52eb6.jpg"], "title": "My Name Is Lucy Barton", "description": "A new book by Pulitzer Prize winner Elizabeth Strout is cause for celebration. Her bestselling novels, including Olive Kitteridge and The Burgess Boys,have illuminated our most tender relationships. Now, in My Name Is Lucy Barton, this extraordinary writer shows how a simple hospital visit becomes a portal to the most tender relationship of all—the one between mother and d A new book by Pulitzer Prize winner Elizabeth Strout is cause for celebration. Her bestselling novels, including Olive Kitteridge and The Burgess Boys, have illuminated our most tender relationships. Now, in My Name Is Lucy Barton, this extraordinary writer shows how a simple hospital visit becomes a portal to the most tender relationship of all—the one between mother and daughter.   Lucy Barton is recovering slowly from what should have been a simple operation. Her mother, to whom she hasn’t spoken for many years, comes to see her. Gentle gossip about people from Lucy’s childhood in Amgash, Illinois, seems to reconnect them, but just below the surface lie the tension and longing that have informed every aspect of Lucy’s life: her escape from her troubled family, her desire to become a writer, her marriage, her love for her two daughters. Knitting this powerful narrative together is the brilliant storytelling voice of Lucy herself: keenly observant, deeply human, and truly unforgettable. ...more", "star_rating": 1, "upc": "727bf2b86b19ad88", "product_type": "Books", "currency": "£", "price_exceltax": 41.56, "price_incltax": 41.56, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/hamilton-the-revolution_699/index.html", "url_md5": "http://books.toscrape.com/catalogue/hamilton-the-revolution_699/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/03/1f/031f508a4a8ef70743ea7e9d4f598d38.jpg"], "title": "Hamilton: The Revolution", "description": "Lin-Manuel Miranda's groundbreaking musical Hamilton is as revolutionary as its subject, the poor kid from the Caribbean who fought the British, defended the Constitution, and helped to found the United States. Fusing hip-hop, pop, R&B, and the best traditions of theater, this once-in-a-generation show broadens the sound of Broadway, reveals the storytelling power of r Lin-Manuel Miranda's groundbreaking musical Hamilton is as revolutionary as its subject, the poor kid from the Caribbean who fought the British, defended the Constitution, and helped to found the United States. Fusing hip-hop, pop, R&B, and the best traditions of theater, this once-in-a-generation show broadens the sound of Broadway, reveals the storytelling power of rap, and claims our country's origins for a diverse new generation.HAMILTON: THE REVOLUTION gives readers an unprecedented view of both revolutions, from the only two writers able to provide it. Miranda, along with Jeremy McCarter, a cultural critic and theater artist who was involved in the project from its earliest stages--\"since before this was even a show,\" according to Miranda--traces its development from an improbable perfor­mance at the White House to its landmark opening night on Broadway six years later. In addition, Miranda has written more than 200 funny, revealing footnotes for his award-winning libretto, the full text of which is published here.Their account features photos by the renowned Frank Ockenfels and veteran Broadway photographer, Joan Marcus; exclusive looks at notebooks and emails; interviews with Questlove, Stephen Sond­heim, leading political commentators, and more than 50 people involved with the production; and multiple appearances by Presi­dent Obama himself. The book does more than tell the surprising story of how a Broadway musical became a national phenomenon: It demonstrates that America has always been renewed by the brash upstarts and brilliant outsiders, the men and women who don't throw away their shot. ...more", "star_rating": 3, "upc": "afa829857f82f99e", "product_type": "Books", "currency": "£", "price_exceltax": 58.79, "price_incltax": 58.79, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/hold-your-breath-search-and-rescue-1_700/index.html", "url_md5": "http://books.toscrape.com/catalogue/hold-your-breath-search-and-rescue-1_700/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/3d/4d/3d4d8e92429144f6c807adc4b15b7f80.jpg"], "title": "Hold Your Breath (Search and Rescue #1)", "description": "In the remote Rocky Mountains, lives depend on the Search & Rescue brotherhood. But in a place this far off the map, trust is hard to come by and secrets can be murder...As the captain of Field County's ice rescue dive team, Callum Cook is driven to perfection. But when he meets new diver Louise \"Lou\" Sparks, all that hard-won order is obliterated in an instant. Lou is In the remote Rocky Mountains, lives depend on the Search & Rescue brotherhood. But in a place this far off the map, trust is hard to come by and secrets can be murder...As the captain of Field County's ice rescue dive team, Callum Cook is driven to perfection. But when he meets new diver Louise \"Lou\" Sparks, all that hard-won order is obliterated in an instant. Lou is a hurricane. A walking disaster. And with her, he's never felt more alive...even if keeping her safe may just kill him.Lou's new to the Rockies, intent on escaping her controlling ex, and she's determined to make it on her own terms...no matter how tempting Callum may be. But when a routine training exercise unearths a body, Lou and Callum find themselves thrust into a deadly game of cat and mouse with a killer who will stop at nothing to silence Lou-and prove that not even her new Search and Rescue family can keep her safe forever. ...more", "star_rating": 1, "upc": "0b165bd4b9f42fd5", "product_type": "Books", "currency": "£", "price_exceltax": 28.82, "price_incltax": 28.82, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/code-name-verity-code-name-verity-1_680/index.html", "url_md5": "http://books.toscrape.com/catalogue/code-name-verity-code-name-verity-1_680/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/65/9a/659ada7d88e3bda8db70f7e5312a39e2.jpg"], "title": "Code Name Verity (Code Name Verity #1)", "description": "I have two weeks. You'll shoot me at the end no matter what I do.That's what you do to enemy agents. It's what we do to enemy agents. But I look at all the dark and twisted roads ahead and cooperation is the easy way out. Possibly the only way out for a girl caught red-handed doing dirty work like mine - and I will do anything, anything to avoid SS-Hauptsturmführer von Lin I have two weeks. You'll shoot me at the end no matter what I do.That's what you do to enemy agents. It's what we do to enemy agents. But I look at all the dark and twisted roads ahead and cooperation is the easy way out. Possibly the only way out for a girl caught red-handed doing dirty work like mine - and I will do anything, anything to avoid SS-Hauptsturmführer von Linden interrogating me again.He has said that I can have as much paper as I need. All I have to do is cough up everything I can remember about the British War Effort. And I'm going to. But the story of how I came to be here starts with my friend Maddie. She is the pilot who flew me into France - an Allied Invasion of Two.We are a sensational team. ...more", "star_rating": 4, "upc": "33a3e0e3ffde0dcd", "product_type": "Books", "currency": "£", "price_exceltax": 22.13, "price_incltax": 22.13, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/clockwork-angel-the-infernal-devices-1_679/index.html", "url_md5": "http://books.toscrape.com/catalogue/clockwork-angel-the-infernal-devices-1_679/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/2f/9f/2f9ff4e4be85da448b02108171b54c3b.jpg"], "title": "Clockwork Angel (The Infernal Devices #1)", "description": "In a time when Shadowhunters are barely winning the fight against the forces of darkness, one battle will change the course of history forever. Welcome to the Infernal Devices trilogy, a stunning and dangerous prequel to the New York Times bestselling Mortal Instruments series.The year is 1878. Tessa Gray descends into London’s dark supernatural underworld in search of her In a time when Shadowhunters are barely winning the fight against the forces of darkness, one battle will change the course of history forever. Welcome to the Infernal Devices trilogy, a stunning and dangerous prequel to the New York Times bestselling Mortal Instruments series.The year is 1878. Tessa Gray descends into London’s dark supernatural underworld in search of her missing brother. She soon discovers that her only allies are the demon-slaying Shadowhunters—including Will and Jem, the mysterious boys she is attracted to. Soon they find themselves up against the Pandemonium Club, a secret organization of vampires, demons, warlocks, and humans. Equipped with a magical army of unstoppable clockwork creatures, the Club is out to rule the British Empire, and only Tessa and her allies can stop them... ...more", "star_rating": 1, "upc": "42b0c50fc44140ec", "product_type": "Books", "currency": "£", "price_exceltax": 44.14, "price_incltax": 44.14, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/adulthood-is-a-myth-a-sarahs-scribbles-collection_659/index.html", "url_md5": "http://books.toscrape.com/catalogue/adulthood-is-a-myth-a-sarahs-scribbles-collection_659/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/bd/b8/bdb8adf93cb0a6778930ccd543dd9b37.jpg"], "title": "Adulthood Is a Myth: A \"Sarah's Scribbles\" Collection", "description": "Are you a special snowflake? Do you enjoy networking to advance your career? Is adulthood an exciting new challenge for which you feel fully prepared? Ugh. Please go away.This book is for the rest of us. These comic document the wasting of entire beautiful weekends on the internet, the unbearable agony of holding hands on the street with a gorgeous guy, dreaming all day of Are you a special snowflake? Do you enjoy networking to advance your career? Is adulthood an exciting new challenge for which you feel fully prepared? Ugh. Please go away.This book is for the rest of us. These comic document the wasting of entire beautiful weekends on the internet, the unbearable agony of holding hands on the street with a gorgeous guy, dreaming all day of getting home and back into pajamas, and wondering when, exactly, this adulthood thing begins. In other words, the horrors and awkwardnesses of young modern life. ...more", "star_rating": 2, "upc": "5319169a72714c62", "product_type": "Books", "currency": "£", "price_exceltax": 10.9, "price_incltax": 10.9, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/all-the-light-we-cannot-see_660/index.html", "url_md5": "http://books.toscrape.com/catalogue/all-the-light-we-cannot-see_660/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/a6/96/a696c1d6bb1ff8f65f51a116160b2aef.jpg"], "title": "All the Light We Cannot See", "description": "WINNER OF THE PULITZER PRIZEFrom the highly acclaimed, multiple award-winning Anthony Doerr, the beautiful, stunningly ambitious instant New York Times bestseller about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II.Marie-Laure lives with her father in Paris near the Museum of Natural Histo WINNER OF THE PULITZER PRIZEFrom the highly acclaimed, multiple award-winning Anthony Doerr, the beautiful, stunningly ambitious instant New York Times bestseller about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II.Marie-Laure lives with her father in Paris near the Museum of Natural History, where he works as the master of its thousands of locks. When she is six, Marie-Laure goes blind and her father builds a perfect miniature of their neighborhood so she can memorize it by touch and navigate her way home. When she is twelve, the Nazis occupy Paris and father and daughter flee to the walled citadel of Saint-Malo, where Marie-Laure’s reclusive great-uncle lives in a tall house by the sea. With them they carry what might be the museum’s most valuable and dangerous jewel.In a mining town in Germany, the orphan Werner grows up with his younger sister, enchanted by a crude radio they find. Werner becomes an expert at building and fixing these crucial new instruments, a talent that wins him a place at a brutal academy for Hitler Youth, then a special assignment to track the resistance. More and more aware of the human cost of his intelligence, Werner travels through the heart of the war and, finally, into Saint-Malo, where his story and Marie-Laure’s converge.Doerr’s “stunning sense of physical detail and gorgeous metaphors” (San Francisco Chronicle) are dazzling. Deftly interweaving the lives of Marie-Laure and Werner, he illuminates the ways, against all odds, people try to be good to one another. Ten years in the writing, a National Book Award finalist, All the Light We Cannot See is a magnificent, deeply moving novel from a writer “whose sentences never fail to thrill” (Los Angeles Times). ...more", "star_rating": 5, "upc": "39861fc1c0845d15", "product_type": "Books", "currency": "£", "price_exceltax": 29.87, "price_incltax": 29.87, "tax": 0.0, "availability": 14, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-midnight-watch-a-novel-of-the-titanic-and-the-californian_640/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-midnight-watch-a-novel-of-the-titanic-and-the-californian_640/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/d8/63/d8630e50f24c22765c9591a9297ff2e1.jpg"], "title": "The Midnight Watch: A Novel of the Titanic and the Californian", "description": "As the Titanic and her passengers sank slowly into the Atlantic Ocean after striking an iceberg late in the evening of April 14, 1912, a nearby ship looked on. Second Officer Herbert Stone, in charge of the midnight watch on the SS Californian sitting idly a few miles north, saw the distress rockets that the Titanic fired. He alerted the captain, Stanley Lord, who was slee As the Titanic and her passengers sank slowly into the Atlantic Ocean after striking an iceberg late in the evening of April 14, 1912, a nearby ship looked on. Second Officer Herbert Stone, in charge of the midnight watch on the SS Californian sitting idly a few miles north, saw the distress rockets that the Titanic fired. He alerted the captain, Stanley Lord, who was sleeping in the chartroom below, but Lord did not come to the bridge. Eight rockets were fired during the dark hours of the midnight watch, and eight rockets were ignored. The next morning, the Titanic was at the bottom of the sea and more than 1,500 people were dead. When they learned of the extent of the tragedy, Lord and Stone did everything they could to hide their role in the disaster, but pursued by newspapermen, lawyers, and political leaders in America and England, their terrible secret was eventually revealed. The Midnight Watch is a fictional telling of what may have occurred that night on the SS Californian, and the resulting desperation of Officer Stone and Captain Lord in the aftermath of their inaction.Told not only from the perspective of the SS Californian crew, but also through the eyes of a family of third-class passengers who perished in the disaster, the narrative is drawn together by Steadman, a tenacious Boston journalist who does not rest until the truth is found. The Midnight Watch is a powerful and dramatic debut novel--the result of many years of research in Liverpool, London, New York, and Boston, and informed by the author's own experiences as a ship's officer and a lawyer. ...more", "star_rating": 1, "upc": "14e44163678e24dc", "product_type": "Books", "currency": "£", "price_exceltax": 26.2, "price_incltax": 26.2, "tax": 0.0, "availability": 12, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-lonely-city-adventures-in-the-art-of-being-alone_639/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-lonely-city-adventures-in-the-art-of-being-alone_639/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/79/66/79660d2683a90670aa014cae6e02b2dc.jpg"], "title": "The Lonely City: Adventures in the Art of Being Alone", "description": "An expertly crafted work of reportage, memoir and biography on the subject of loneliness told through the lives of iconic artists, by the acclaimed author of The Trip to Echo Spring What does it mean to be lonely? How do we live, if we're not intimately engaged with another human being? How do we connect with other people? Does technology draw us closer together or trap us An expertly crafted work of reportage, memoir and biography on the subject of loneliness told through the lives of iconic artists, by the acclaimed author of The Trip to Echo Spring What does it mean to be lonely? How do we live, if we're not intimately engaged with another human being? How do we connect with other people? Does technology draw us closer together or trap us behind screens?When Olivia Laing moved to New York City in her mid-thirties, she found herself inhabiting loneliness on a daily basis. Increasingly fascinated by this most shameful of experiences, she began to explore the lonely city by way of art. Moving fluidly between works and lives - from Edward Hopper's Nighthawks to Andy Warhol's Time Capsules, from Henry Darger's hoarding to the depredations of the AIDS crisis - Laing conducts an electric, dazzling investigation into what it means to be alone, illuminating not only the causes of loneliness but also how it might be resisted and redeemed.Humane, provocative and deeply moving, The Lonely City is about the spaces between people and the things that draw them together, about sexuality, mortality and the magical possibilities of art. It's a celebration of a strange and lovely state, adrift from the larger continent of human experience, but intrinsic to the very act of being alive. ...more", "star_rating": 2, "upc": "582a21a1dbbef3cf", "product_type": "Books", "currency": "£", "price_exceltax": 33.26, "price_incltax": 33.26, "tax": 0.0, "availability": 12, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/hide-away-eve-duncan-20_620/index.html", "url_md5": "http://books.toscrape.com/catalogue/hide-away-eve-duncan-20_620/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/b2/c5/b2c501b848bccd9cc375771f53c0fb6e.jpg"], "title": "Hide Away (Eve Duncan #20)", "description": "Iris Johansen's beloved forensic sculptor Eve Duncan is back and now the stakes are higher than ever. Dramatic changes are on the horizon for Eve and Joe Quinn and their relationship may never be the same. Faced with the task of protecting Cara Delaney, a young girl with ruthless enemies who want to see her dead, Eve takes her away to the remote Scottish Highlands where th Iris Johansen's beloved forensic sculptor Eve Duncan is back and now the stakes are higher than ever. Dramatic changes are on the horizon for Eve and Joe Quinn and their relationship may never be the same. Faced with the task of protecting Cara Delaney, a young girl with ruthless enemies who want to see her dead, Eve takes her away to the remote Scottish Highlands where they join Jane MacGuire in search of a hidden treasure. But nowhere is far enough away to protect Cara from danger. With enemies closing in from all sides, Hide Away is a high-octane thriller that fans will not want to miss. ...more", "star_rating": 1, "upc": "bddc6fd036eb6279", "product_type": "Books", "currency": "£", "price_exceltax": 11.84, "price_incltax": 11.84, "tax": 0.0, "availability": 12, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/furiously-happy-a-funny-book-about-horrible-things_619/index.html", "url_md5": "http://books.toscrape.com/catalogue/furiously-happy-a-funny-book-about-horrible-things_619/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/28/4c/284c3b0cbb254825f5bfd60e89d936af.jpg"], "title": "Furiously Happy: A Funny Book About Horrible Things", "description": "In LET'S PRETEND THIS NEVER HAPPENED, Jenny Lawson baffled readers with stories about growing up the daughter of a taxidermist. In her new book, FURIOUSLY HAPPY, Jenny explores her lifelong battle with mental illness. A hysterical, ridiculous book about crippling depression and anxiety? That sounds like a terrible idea. And terrible ideas are what Jenny does best.According In LET'S PRETEND THIS NEVER HAPPENED, Jenny Lawson baffled readers with stories about growing up the daughter of a taxidermist. In her new book, FURIOUSLY HAPPY, Jenny explores her lifelong battle with mental illness. A hysterical, ridiculous book about crippling depression and anxiety? That sounds like a terrible idea. And terrible ideas are what Jenny does best.According to Jenny: \"Some people might think that being 'furiously happy' is just an excuse to be stupid and irresponsible and invite a herd of kangaroos over to your house without telling your husband first because you suspect he would say no since he's never particularly liked kangaroos. And that would be ridiculous because no one would invite a herd of kangaroos into their house. Two is the limit. I speak from personal experience. My husband says that none is the new limit. I say he should have been clearer about that before I rented all those kangaroos.\"\"Most of my favorite people are dangerously fucked-up but you'd never guess because we've learned to bare it so honestly that it becomes the new normal. Like John Hughes wrote in The Breakfast Club, 'We're all pretty bizarre. Some of us are just better at hiding it.' Except go back and cross out the word 'hiding.'\"Jenny's first book, LET'S PRETEND THIS NEVER HAPPENED, was ostensibly about family, but deep down it was about celebrating your own weirdness. FURIOUSLY HAPPY is a book about mental illness, but under the surface it's about embracing joy in fantastic and outrageous ways-and who doesn't need a bit more of that? ...more", "star_rating": 4, "upc": "c6a29d6df8de968c", "product_type": "Books", "currency": "£", "price_exceltax": 41.46, "price_incltax": 41.46, "tax": 0.0, "availability": 12, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/mothering-sunday_600/index.html", "url_md5": "http://books.toscrape.com/catalogue/mothering-sunday_600/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/9b/1a/9b1a03d05c16c71050daefad8840ec91.jpg"], "title": "Mothering Sunday", "description": "From the Booker Award winner: a luminous, profoundly moving work of fiction that begins with an afternoon tryst in 1924 between a servant girl and the young man of the neighboring house, but then opens to reveal the whole life of a remarkable woman.Twenty-two year old Jane Fairchild, orphaned at birth, has worked as a maid at one English country estate since she was sixtee From the Booker Award winner: a luminous, profoundly moving work of fiction that begins with an afternoon tryst in 1924 between a servant girl and the young man of the neighboring house, but then opens to reveal the whole life of a remarkable woman.Twenty-two year old Jane Fairchild, orphaned at birth, has worked as a maid at one English country estate since she was sixteen. And for almost all of those years she has been the secret lover to Paul Sheringham, the scion of the estate next door. On an unseasonably warm March afternoon, Jane and Paul will make love for the last time--though not, as Jane believes, because Paul is about to be married--and the events of the day will alter Jane's life forever. As the narrative moves back and forth from 1924 to the end of the century, what we know and understand about Jane--about the way she loves, thinks, feels, sees, remembers--deepens with every beautifully wrought moment. Her story is one of profound self-discovery and through her, Graham Swift has created an emotionally soaring and deeply affecting work of fiction. ...more", "star_rating": 2, "upc": "47e1b2d43f709995", "product_type": "Books", "currency": "£", "price_exceltax": 13.34, "price_incltax": 13.34, "tax": 0.0, "availability": 11, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/mother-can-you-not_599/index.html", "url_md5": "http://books.toscrape.com/catalogue/mother-can-you-not_599/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/88/b4/88b464746c5882cc605827a0521ddcea.jpg"], "title": "Mother, Can You Not?", "description": "Based on the wildly popular Instagram account @CrazyJewishMom, Kate Siegel's essay collection about life with the woman who redefined the term \"helicopter mom\" There is nothing more wonderful than a mother’s love. There is also nothing more annoying. Who else can proudly insist that you’re perfect while simultaneously making you question every career, fashion, andrelation Based on the wildly popular Instagram account @CrazyJewishMom, Kate Siegel's essay collection about life with the woman who redefined the term \"helicopter mom\"   There is nothing more wonderful than a mother’s love. There is also nothing more annoying. Who else can proudly insist that you’re perfect while simultaneously making you question every career, fashion, and relationship decision you have ever made?   No one understands the delicate mother-daughter dynamic better than Kate Siegel—her own mother drove her so crazy that she decided to broadcast their hilarious conversations on Instagram. Soon, hundreds of thousands of people were following their daily text exchanges, eager to see what outrageous thing Kate’s mom would do next. Now, in Mother, Can You NOT?, Kate pays tribute to the woman who invented the concept of drone parenting.  From embarrassing moments (like crashing Kate's gynecological exams) to outrageous stories (like the time she made Kate steal a cat from the pound) to hilarious celebrations (including but not limited to parties for Kate's menstrual cycles), Mother, Can you NOT? lovingly lampoons the lengths to which our mothers will go to better our lives (even if it feels like they’re ruining them in the process). ...more", "star_rating": 5, "upc": "28b2df9fadc9f07e", "product_type": "Books", "currency": "£", "price_exceltax": 16.89, "price_incltax": 16.89, "tax": 0.0, "availability": 11, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/watchmen_579/index.html", "url_md5": "http://books.toscrape.com/catalogue/watchmen_579/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/a0/76/a07621adcf3e13b4d3bcdc0474ab2098.jpg"], "title": "Watchmen", "description": "This Hugo Award-winning graphic novel chronicles the fall from grace of a group of super-heroes plagued by all-too-human failings. Along the way, the concept of the super-hero is dissected as the heroes are stalked by an unknown assassin.One of the most influential graphic novels of all time and a perennial best-seller, Watchmen has been studied on college campuses across This Hugo Award-winning graphic novel chronicles the fall from grace of a group of super-heroes plagued by all-too-human failings. Along the way, the concept of the super-hero is dissected as the heroes are stalked by an unknown assassin.One of the most influential graphic novels of all time and a perennial best-seller, Watchmen has been studied on college campuses across the nation and is considered a gateway title, leading readers to other graphic novels such as V for Vendetta, Batman: The Dark Knight Returns and The Sandman series. ...more", "star_rating": 4, "upc": "d1848064c54e01c7", "product_type": "Books", "currency": "£", "price_exceltax": 58.05, "price_incltax": 58.05, "tax": 0.0, "availability": 9, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/without-shame_580/index.html", "url_md5": "http://books.toscrape.com/catalogue/without-shame_580/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/6c/21/6c21a47589ec756b9ed27e2f331c08de.jpg"], "title": "Without Shame", "description": "East Pakistan, 1968: In Sariyah’s village, shame is a virtue she never mastered. As a child, she learned to read in secret, kept talismans against her father’s orders, and questioned everything, even Allah. Now she is practicing how to be a “woman with shame,” torn between promises to her family and to herself. She yearns to join a movement with her fellow Bengalis, who ar East Pakistan, 1968: In Sariyah’s village, shame is a virtue she never mastered. As a child, she learned to read in secret, kept talismans against her father’s orders, and questioned everything, even Allah. Now she is practicing how to be a “woman with shame,” torn between promises to her family and to herself. She yearns to join a movement with her fellow Bengalis, who are gripping onto their language and cultural identity against colonial powers – but she is continuously sucked into the narrow visions of her father.In the midst of a desperate movement for Bengali freedom, a presumptuous American has come to teach English. Rodney Creed - self-interested, naive, entitled - comes with the bright optimism of a college graduate, too eager to sense the rumbling ground beneath him...until he meets Sariyah. Rodney believes he is there to teach, but he will learn painful, irreversible things.Without Shame is a love story at its core – but not in the traditional sense. It’s about love of one’s country, culture, God, and language. It’s about the power of identity to shine through when other forces threaten to overshadow it. ...more", "star_rating": 5, "upc": "ab60e6f5a63e1cfb", "product_type": "Books", "currency": "£", "price_exceltax": 48.27, "price_incltax": 48.27, "tax": 0.0, "availability": 9, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/chernobyl-012340-the-incredible-true-story-of-the-worlds-worst-nuclear-disaster_560/index.html", "url_md5": "http://books.toscrape.com/catalogue/chernobyl-012340-the-incredible-true-story-of-the-worlds-worst-nuclear-disaster_560/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/58/4a/584ac01e05ae76b1672f25a53384c617.jpg"], "title": "Chernobyl 01:23:40: The Incredible True Story of the World's Worst Nuclear Disaster", "description": "At 01:23:40 on April 26th 1986, Alexander Akimov pressed the emergency shutdown button at Chernobyl’s fourth nuclear reactor. It was an act that forced the permanent evacuation of a city, killed thousands and crippled the Soviet Union. The event spawned decades of conflicting, exaggerated and inaccurate stories.This book, the result of five years of research, presents an a At 01:23:40 on April 26th 1986, Alexander Akimov pressed the emergency shutdown button at Chernobyl’s fourth nuclear reactor. It was an act that forced the permanent evacuation of a city, killed thousands and crippled the Soviet Union. The event spawned decades of conflicting, exaggerated and inaccurate stories.This book, the result of five years of research, presents an accessible but comprehensive account of what really happened. From the desperate fight to prevent a burning reactor core from irradiating eastern Europe, to the self-sacrifice of the heroic men who entered fields of radiation so strong that machines wouldn’t work, to the surprising truth about the legendary ‘Chernobyl divers’, all the way through to the USSR’s final show-trial. The historical narrative is interwoven with a story of the author’s own spontaneous journey to Ukraine’s still-abandoned city of Pripyat and the wider Chernobyl Zone.Complete with over 45 pages of photographs of modern-day Pripyat and technical diagrams of the power station, Chernobyl 01:23:40 is a fascinating new account of the world’s worst nuclear disaster. ...more", "star_rating": 2, "upc": "7186241e043de5dc", "product_type": "Books", "currency": "£", "price_exceltax": 35.92, "price_incltax": 35.92, "tax": 0.0, "availability": 9, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/art-and-fear-observations-on-the-perils-and-rewards-of-artmaking_559/index.html", "url_md5": "http://books.toscrape.com/catalogue/art-and-fear-observations-on-the-perils-and-rewards-of-artmaking_559/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/87/82/87822798b42545d589822bc712dc38a6.jpg"], "title": "Art and Fear: Observations on the Perils (and Rewards) of Artmaking", "description": "\"This is a book about making art. Ordinary art. Ordinary art means something like: all art not made by Mozart. After all, art is rarely made by Mozart-like people; essentially—statistically speaking—there aren't any people like that. Geniuses get made once-a-century or so, yet good art gets made all the time, so to equate the making of art with the workings of genius remov \"This is a book about making art. Ordinary art. Ordinary art means something like: all art not made by Mozart. After all, art is rarely made by Mozart-like people; essentially—statistically speaking—there aren't any people like that. Geniuses get made once-a-century or so, yet good art gets made all the time, so to equate the making of art with the workings of genius removes this intimately human activity to a strangely unreachable and unknowable place. For all practical purposes making art can be examined in great detail without ever getting entangled in the very remote problems of genius.\"—-from the IntroductionArt & Fear explores the way art gets made, the reasons it often doesn't get made, and the nature of the difficulties that cause so many artists to give up along the way. The book's co-authors, David Bayles and Ted Orland, are themselves both working artists, grappling daily with the problems of making art in the real world. Their insights and observations, drawn from personal experience, provide an incisive view into the world of art as it is expeienced by artmakers themselves.This is not your typical self-help book. This is a book written by artists, for artists -— it's about what it feels like when artists sit down at their easel or keyboard, in their studio or performance space, trying to do the work they need to do. First published in 1994, Art & Fear quickly became an underground classic. Word-of-mouth response alone—now enhanced by internet posting—has placed it among the best-selling books on artmaking and creativity nationally.Art & Fear has attracted a remarkably diverse audience, ranging from beginning to accomplished artists in every medium, and including an exceptional concentration among students and teachers. The original Capra Press edition of Art & Fear sold 80,000 copies.An excerpt:Today, more than it was however many years ago, art is hard because you have to keep after it so consistently. On so many different fronts. For so little external reward. Artists become veteran artists only by making peace not just with themselves, but with a huge range of issues. You have to find your work... ...more", "star_rating": 4, "upc": "d6d9ffea95f2f8bf", "product_type": "Books", "currency": "£", "price_exceltax": 48.63, "price_incltax": 48.63, "tax": 0.0, "availability": 9, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/roller-girl_540/index.html", "url_md5": "http://books.toscrape.com/catalogue/roller-girl_540/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/cf/cf/cfcfb88039ddab7d4ae399246529e401.jpg"], "title": "Roller Girl", "description": "For fans of Raina Telgemeier’s Smile, a heartwarming graphic novel about friendship and surviving junior high through the power of roller derby. Twelve-year-old Astrid has always done everything with her best friend Nicole. So when Astrid signs up for roller derby camp, she assumes Nicole will too. But Nicole signs up for dance camp with a new friend instead, and so begins For fans of Raina Telgemeier’s Smile, a heartwarming graphic novel about friendship and surviving junior high through the power of roller derby. Twelve-year-old Astrid has always done everything with her best friend Nicole. So when Astrid signs up for roller derby camp, she assumes Nicole will too. But Nicole signs up for dance camp with a new friend instead, and so begins the toughest summer of Astrid's life. There are bumps and bruises as Astrid learns who she is without Nicole...and what it takes to be a strong, tough roller girl. ...more", "star_rating": 5, "upc": "aeb51dfbe8aeec59", "product_type": "Books", "currency": "£", "price_exceltax": 14.1, "price_incltax": 14.1, "tax": 0.0, "availability": 8, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/rising-strong_539/index.html", "url_md5": "http://books.toscrape.com/catalogue/rising-strong_539/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/de/5c/de5c4ea75d455748861ce2bc844fb198.jpg"], "title": "Rising Strong", "description": "The physics of vulnerability is simple: If we are brave enough often enough, we will fall. The author of the #1 New York Times bestsellers Daring Greatly and The Gifts of Imperfection tells us what it takes to get back up, and how owning our stories of disappointment, failure, and heartbreak gives us the power to write a daring new ending. Struggle, Brené Brown writes, can The physics of vulnerability is simple: If we are brave enough often enough, we will fall. The author of the #1 New York Times bestsellers Daring Greatly and The Gifts of Imperfection tells us what it takes to get back up, and how owning our stories of disappointment, failure, and heartbreak gives us the power to write a daring new ending. Struggle, Brené Brown writes, can be our greatest call to courage, and rising strong our clearest path to deeper meaning, wisdom, and hope. ...more", "star_rating": 3, "upc": "52fc458ffc756faf", "product_type": "Books", "currency": "£", "price_exceltax": 21.82, "price_incltax": 21.82, "tax": 0.0, "availability": 8, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-origin-of-species_499/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-origin-of-species_499/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/d5/45/d54527d34174d5dd7eaeaaffdfcb3c5c.jpg"], "title": "The Origin of Species", "description": "The publication of Darwin’s The Origin of Species in 1859 marked a dramatic turning point in scientific thought. The volume had taken Darwin more than twenty years to publish, in part because he envisioned the storm of controversy it was certain to unleash. Indeed, selling out its first edition on its first day, The Origin of Species revolutionized science, philosophy, and The publication of Darwin’s The Origin of Species in 1859 marked a dramatic turning point in scientific thought. The volume had taken Darwin more than twenty years to publish, in part because he envisioned the storm of controversy it was certain to unleash. Indeed, selling out its first edition on its first day, The Origin of Species revolutionized science, philosophy, and theology.Darwin’s reasoned, documented arguments carefully advance his theory of natural selection and his assertion that species were not created all at once by a divine hand but started with a few simple forms that mutated and adapted over time. Whether commenting on his own poor health, discussing his experiments to test instinct in bees, or relating a conversation about a South American burrowing rodent, Darwin’s monumental achievement is surprisingly personal and delightfully readable. Its profound ideas remain controversial even today, making it the most influential book in the natural sciences ever written—an important work not just to its time but to the history of humankind. ...more", "star_rating": 4, "upc": "0345872b14f9e774", "product_type": "Books", "currency": "£", "price_exceltax": 10.01, "price_incltax": 10.01, "tax": 0.0, "availability": 7, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-story-of-art_500/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-story-of-art_500/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/7a/e9/7ae92da23efc2f0f4633f9d2cde370f3.jpg"], "title": "The Story of Art", "description": "This text is the 16th revised and updated edition of this introduction to art, from the earliest cave paintings to experimental art. Eight new artists from the modern period have been introduced. They are: Corot, Kollwitz, Nolde, de Chirico, Brancussi, Magritte, Nicolson and Morandi. A sequence of new endings have been added, and the captions are now fuller, including the This text is the 16th revised and updated edition of this introduction to art, from the earliest cave paintings to experimental art. Eight new artists from the modern period have been introduced. They are: Corot, Kollwitz, Nolde, de Chirico, Brancussi, Magritte, Nicolson and Morandi. A sequence of new endings have been added, and the captions are now fuller, including the medium and dimension of the works illustrated. Six fold-outs present selected large-scale works. They are: Van Eyck's Ghent Altarpiece, Leonardo's Last Supper, Botticelli's Birth of Venus, Jackson Pollock's One (Number 31, 1950), Van der Weyden's Descent from the Cross and Michelangelo's Sistine Chapel ceiling. ...more", "star_rating": 4, "upc": "9147c5251cc99eb1", "product_type": "Books", "currency": "£", "price_exceltax": 41.14, "price_incltax": 41.14, "tax": 0.0, "availability": 7, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/heaven-is-for-real-a-little-boys-astounding-story-of-his-trip-to-heaven-and-back_520/index.html", "url_md5": "http://books.toscrape.com/catalogue/heaven-is-for-real-a-little-boys-astounding-story-of-his-trip-to-heaven-and-back_520/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/30/1d/301d6348c94fd869846aeadbeb15dad6.jpg"], "title": "Heaven is for Real: A Little Boy's Astounding Story of His Trip to Heaven and Back", "description": "A beautifully written glimpse into heaven that will encourage those who doubtand thrill those who believe.Ron Hall, coauthor of Same Kind of Different as MeDo you remember the hospital, Colton? Sonja said. Yes, mommy, I remember, he said. That s where theangels sang to me.When Colton Burpo made it through an emergency appendectomy, his familywas overjoyed at his miraculous A beautifully written glimpse into heaven that will encourage those who doubtand thrill those who believe.Ron Hall, coauthor of Same Kind of Different as MeDo you remember the hospital, Colton? Sonja said. Yes, mommy, I remember, he said. That s where theangels sang to me.When Colton Burpo made it through an emergency appendectomy, his familywas overjoyed at his miraculous survival. What they weren t expecting, though, was the story that emerged in the months that followed a story as beautiful as itwas extraordinary, detailing their little boy s trip to heaven and back.Colton, not yet four years old, told his parents he left his body during thesurgery and authenticated that claim by describing exactly what his parents weredoing in another part of the hospital while he was being operated on. He talked ofvisiting heaven and relayed stories told to him by people he met there whom hehad never met in life, sharing events that happened even before he was born. He also astonished his parents with descriptions and obscure details about heaven thatmatched the Bible exactly, though he had not yet learned to read.With disarming innocence and the plainspoken boldness of a child, Colton tells of meeting long-departed family members. He describes Jesus, the angels, how really, really big God is, and how much God loves us. Retold by his father, but using Colton s uniquely simple words, Heaven Is for Real offers a glimpseof the world that awaits us, where as Colton says, Nobody is old and nobodywears glasses.Heaven Is for Real will forever change the way you think of eternity, offeringthe chance to see, and believe, like a child.\" ...more", "star_rating": 2, "upc": "d48c1369927ebef1", "product_type": "Books", "currency": "£", "price_exceltax": 52.86, "price_incltax": 52.86, "tax": 0.0, "availability": 8, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/naturally-lean-125-nourishing-gluten-free-plant-based-recipes-all-under-300-calories_479/index.html", "url_md5": "http://books.toscrape.com/catalogue/naturally-lean-125-nourishing-gluten-free-plant-based-recipes-all-under-300-calories_479/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/5b/46/5b466903acc905deb89019c0407848c4.jpg"], "title": "Naturally Lean: 125 Nourishing Gluten-Free, Plant-Based Recipes--All Under 300 Calories", "description": "When you're hungry for a filling meal, it's easy to go for the unhealthy stuff. Many times, even gluten-free and vegan cuisines can be loaded with sneaky fillers and not-so-good-for-you ingredients. Allyson Kramer proves that low-cal doesn't have to mean low-satisfaction; these gluten-free, plant-based recipes are high in nutrients, have less than 300 calories per serving— When you're hungry for a filling meal, it's easy to go for the unhealthy stuff. Many times, even gluten-free and vegan cuisines can be loaded with sneaky fillers and not-so-good-for-you ingredients. Allyson Kramer proves that low-cal doesn't have to mean low-satisfaction; these gluten-free, plant-based recipes are high in nutrients, have less than 300 calories per serving—and they taste amazing. Dig into Cheesy BBQ Kale Chips, Cinnamon Plum Streusel, Avocado Chick'n Salad, and so much more. There are no fillers, no added or refined sugars, and no processed ingredients you can't pronounce. Whether it's breakfast, lunch, snacks, small plates, entrees, or beverages, you'll find a hearty, healthy recipe for every craving.   ...more", "star_rating": 5, "upc": "924438fc6cbec836", "product_type": "Books", "currency": "£", "price_exceltax": 11.38, "price_incltax": 11.38, "tax": 0.0, "availability": 7, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/nightstruck-a-novel_480/index.html", "url_md5": "http://books.toscrape.com/catalogue/nightstruck-a-novel_480/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/cb/da/cbda49820de480220af3dff2d30c689a.jpg"], "title": "Nightstruck: A Novel", "description": "It starts with a cry in the night.Becket, walking her dog one winter evening, fears it’s an abandoned baby left out in the cold. But it is something else—something evil—and it tricks Becket into opening a doorway to another realm, letting a darkness into our world, a corruption that begins transforming Philadelphia into a sinister and menacing version of itself…but only at It starts with a cry in the night.Becket, walking her dog one winter evening, fears it’s an abandoned baby left out in the cold. But it is something else—something evil—and it tricks Becket into opening a doorway to another realm, letting a darkness into our world, a corruption that begins transforming Philadelphia into a sinister and menacing version of itself…but only at night.The changes are subtle at first, causing Becket to doubt her senses and her sanity. But soon the nightmarish truth is impossible to deny: By day, the city is just a city, but at night it literally comes alive with malevolent purpose. Brick and steel become bone, streetlights turn into gallows, and hungry alleys wait to snare mortal victims. Terrified citizens huddle indoors after dusk, as others succumb to the siren song of the night, letting their darker sides run wild.Once, Becket’s biggest problems were living up to her police commissioner father’s high expectations and a secret crush on her best friend’s boyfriend. Now she must find a way to survive and protect her loved ones…before the darkness takes her as well. ...more", "star_rating": 4, "upc": "746029796363aa51", "product_type": "Books", "currency": "£", "price_exceltax": 50.35, "price_incltax": 50.35, "tax": 0.0, "availability": 7, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/future-shock-future-shock-1_519/index.html", "url_md5": "http://books.toscrape.com/catalogue/future-shock-future-shock-1_519/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/7c/eb/7cebcafb82ec5f208d1613b35337d59d.jpg"], "title": "Future Shock (Future Shock #1)", "description": "What do you do when the future is too late, and the present is counting down to an inevitable moment?Elena Martinez has street smarts, the ability for perfect recall, and a deadline: if she doesn’t find a job before she turns eighteen, she’ll be homeless. But then she gets an unexpected offer from Aether Corporation, the powerful Los Angeles tech giant. Along with four oth What do you do when the future is too late, and the present is counting down to an inevitable moment?Elena Martinez has street smarts, the ability for perfect recall, and a deadline: if she doesn’t find a job before she turns eighteen, she’ll be homeless. But then she gets an unexpected offer from Aether Corporation, the powerful Los Angeles tech giant. Along with four other recruits—Adam, Chris, Trent, and Zoe—Elena is being sent on a secret mission to bring back data from the future. All they have to do is get Aether the information they need, and the five of them will be set for life. It’s an offer Elena can’t refuse.But something goes wrong when the time travelers arrive in the future. And they are forced to break the only rule they were given—not to look into their own fates. Now they have twenty-four hours to get back to the present and find a way to stop a seemingly inevitable future—and a murder—from happening. But changing the timeline has deadly consequences too. Who can Elena trust as she fights to save her life?The first book in an unforgettable series about rewriting your destiny in the city of dreams. ...more", "star_rating": 5, "upc": "df6a7c43faa6732b", "product_type": "Books", "currency": "£", "price_exceltax": 55.65, "price_incltax": 55.65, "tax": 0.0, "availability": 8, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/benjamin-franklin-an-american-life_460/index.html", "url_md5": "http://books.toscrape.com/catalogue/benjamin-franklin-an-american-life_460/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/c2/7e/c27efce6a2321c10b0d34035308ace37.jpg"], "title": "Benjamin Franklin: An American Life", "description": "Benjamin Franklin is the Founding Father who winks at us. An ambitious urban entrepreneur who rose up the social ladder, from leather-aproned shopkeeper to dining with kings, he seems made of flesh rather than of marble. In bestselling author Walter Isaacson's vivid and witty full-scale biography, we discover why Franklin seems to turn to us from history's stage with eyes Benjamin Franklin is the Founding Father who winks at us. An ambitious urban entrepreneur who rose up the social ladder, from leather-aproned shopkeeper to dining with kings, he seems made of flesh rather than of marble. In bestselling author Walter Isaacson's vivid and witty full-scale biography, we discover why Franklin seems to turn to us from history's stage with eyes that twinkle from behind his new-fangled spectacles. By bringing Franklin to life, Isaacson shows how he helped to define both his own time and ours. He was, during his 84-year life, America's best scientist, inventor, diplomat, writer, and business strategist, and he was also one of its most practical -- though not most profound -- political thinkers. He proved by flying a kite that lightning was electricity, and he invented a rod to tame it. He sought practical ways to make stoves less smoky and commonwealths less corrupt. He organized neighborhood constabularies and international alliances, local lending libraries and national legislatures. He combined two types of lenses to create bifocals and two concepts of representation to foster the nation's federal compromise. He was the only man who shaped all the founding documents of America: the Albany Plan of Union, the Declaration of Independence, the treaty of alliance with France, the peace treaty with England, and the Constitution. And he helped invent America's unique style of homespun humor, democratic values, and philosophical pragmatism. But the most interesting thing that Franklin invented, and continually reinvented, was himself. America's first great publicist, he was, in his life and in his writings, consciously trying to create a new American archetype. In the process, he carefully crafted his own persona, portrayed it in public, and polished it for posterity. Through it all, he trusted the hearts and minds of his fellow \"leather-aprons\" more than he did those of any inbred elite. He saw middle-class values as a source of social strength, not as something to be derided. His guiding principle was a \"dislike of everything that tended to debase the spirit of the common people.\" Few of his fellow founders felt this comfort with democracy so fully, and none so intuitively. In this colorful and intimate narrative, Isaacson provides the full sweep of Franklin's amazing life, from his days as a runaway printer to his triumphs as a statesman, scientist, and Founding Father. He chronicles Franklin's tumultuous relationship with his illegitimate son and grandson, his practical marriage, and his flirtations with the ladies of Paris. He also shows how Franklin helped to create the American character and why he has a particular resonance in the twenty-first century. ...more", "star_rating": 3, "upc": "5b546a46a86a9d8c", "product_type": "Books", "currency": "£", "price_exceltax": 48.19, "price_incltax": 48.19, "tax": 0.0, "availability": 7, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/at-the-existentialist-cafe-freedom-being-and-apricot-cocktails-with-jean-paul-sartre-simone-de-beauvoir-albert-camus-martin-heidegger-edmund-husserl-karl-jaspers-maurice-merleau-ponty-and-others_459/index.html", "url_md5": "http://books.toscrape.com/catalogue/at-the-existentialist-cafe-freedom-being-and-apricot-cocktails-with-jean-paul-sartre-simone-de-beauvoir-albert-camus-martin-heidegger-edmund-husserl-karl-jaspers-maurice-merleau-ponty-and-others_459/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/ce/da/ceda6d577d0609261f997bd99872013b.jpg"], "title": "At The Existentialist Café: Freedom, Being, and apricot cocktails with: Jean-Paul Sartre, Simone de Beauvoir, Albert Camus, Martin Heidegger, Edmund Husserl, Karl Jaspers, Maurice Merleau-Ponty and others", "description": "Paris, near the turn of 1933. Three young friends meet over apricot cocktails at the Bec-de-Gaz bar on the rue Montparnasse. They are Jean-Paul Sartre, Simone de Beauvoir and their friend Raymond Aron, who opens their eyes to a radical new way of thinking. Pointing to his drink, he says, 'You can make philosophy out of this cocktail!'From this moment of inspiration, Sartre Paris, near the turn of 1933. Three young friends meet over apricot cocktails at the Bec-de-Gaz bar on the rue Montparnasse. They are Jean-Paul Sartre, Simone de Beauvoir and their friend Raymond Aron, who opens their eyes to a radical new way of thinking. Pointing to his drink, he says, 'You can make philosophy out of this cocktail!'From this moment of inspiration, Sartre will create his own extraordinary philosophy of real, experienced life – of love and desire, of freedom and being, of cafés and waiters, of friendships and revolutionary fervour. It is a philosophy that will enthral Paris and sweep through the world, leaving its mark on post-war liberation movements, from the student uprisings of 1968 to civil rights pioneers.At the Existentialist Café tells the story of modern existentialism as one of passionate encounters between people, minds and ideas. From the ‘king and queen of existentialism' – Sartre and de Beauvoir – to their wider circle of friends and adversaries including Albert Camus, Martin Heidegger, Maurice Merleau-Ponty and Iris Murdoch, this book is an enjoyable and original journey through a captivating intellectual movement. Weaving biography and thought, Sarah Bakewell takes us to the heart of a philosophy about life that also changed lives, and that tackled the biggest questions of all: what we are and how we are to live. ...more", "star_rating": 5, "upc": "6b52904b2ab91bf6", "product_type": "Books", "currency": "£", "price_exceltax": 29.93, "price_incltax": 29.93, "tax": 0.0, "availability": 7, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-barefoot-contessa-cookbook_440/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-barefoot-contessa-cookbook_440/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/5f/c1/5fc1de838c428ae58f3a9ec08825d179.jpg"], "title": "The Barefoot Contessa Cookbook", "description": "For more than twenty years, Barefoot Contessa, the acclaimed specialty food store, has been cooking and baking extraordinary dishes for enthusiastic customers in the Hamptons. For many of those years, people have tried to get the exuberant owner, Ina Garten, to share the secrets of her store. Finally, the energy and style that make Barefoot Contessa such a special place ar For more than twenty years, Barefoot Contessa, the acclaimed specialty food store, has been cooking and baking extraordinary dishes for enthusiastic customers in the Hamptons. For many of those years, people have tried to get the exuberant owner, Ina Garten, to share the secrets of her store. Finally, the energy and style that make Barefoot Contessa such a special place are shown here, with dozens of recipes and more than 160 breathtaking photographs, in The Barefoot Contessa Cookbook.Ina's most popular recipes use familiar ingredients, but they taste even better than you would expect. Her Pan-Fried Onion Dip is the real thing, with slowly car-amelized onions and fresh sour cream. Tomato soup is created from oven-roasted tomatoes and fresh basil to intensify the flavors. Meat loaf is as good as your grandmother's, but it's healthier because it's made with ground turkey and fresh herbs. The light and flaky Maple-Oatmeal Scones are baked with rolled oats, whole wheat, and real maple syrup. Now these and other famous Barefoot Contessa recipes can be prepared at home.Ina says that before she owned a specialty food store she often spent a week making dinner for six friends. Her experience at Barefoot Contessa has given her hundreds of ideas for creating wonderful parties in a few hours. And they're all in this book. Crab Cakes with Rémoulade Sauce can be stored overnight in the refrigerator and sautéed just before the guests arrive. Cheddar Corn Chowder can be made days ahead, reheated, and served with a salad and bread for a delicious autumn lunch. The ingredients for Grilled Salmon Salad can all be prepared ahead and tossed together before serving. The batter for the Raspberry Corn Muffins can be mixed a day before and popped into the oven just before breakfast.Ina Garten teaches us how to entertain with style, simplicity, and a relaxed sense of fun. There are notes throughout the book for giving cocktail parties, lunches, and dinner parties where everything is done before the guests arrive. And there are easy instructions for creating gorgeous party platters that don't even require you to cook!With Ina Garten and The Barefoot Contessa Cookbook, you have the perfect recipe for hosting parties that are easy and fun for everyone--including the cook. ...more", "star_rating": 5, "upc": "6478ccb4416e6a5d", "product_type": "Books", "currency": "£", "price_exceltax": 59.92, "price_incltax": 59.92, "tax": 0.0, "availability": 6, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/tell-the-wolves-im-home_439/index.html", "url_md5": "http://books.toscrape.com/catalogue/tell-the-wolves-im-home_439/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/78/48/784872c69237efaf5df8c0282280ff05.jpg"], "title": "Tell the Wolves I'm Home", "description": "In this striking literary debut, Carol Rifka Brunt unfolds a moving story of love, grief, and renewal as two lonely people become the unlikeliest of friends and find that sometimes you don’t know you’ve lost someone until you’ve found them.1987. There’s only one person who has ever truly understood fourteen-year-old June Elbus, and that’s her uncle, the renowned painter Fi In this striking literary debut, Carol Rifka Brunt unfolds a moving story of love, grief, and renewal as two lonely people become the unlikeliest of friends and find that sometimes you don’t know you’ve lost someone until you’ve found them.1987. There’s only one person who has ever truly understood fourteen-year-old June Elbus, and that’s her uncle, the renowned painter Finn Weiss. Shy at school and distant from her older sister, June can only be herself in Finn’s company; he is her godfather, confidant, and best friend. So when he dies, far too young, of a mysterious illness her mother can barely speak about, June’s world is turned upside down. But Finn’s death brings a surprise acquaintance into June’s life - someone who will help her to heal and to question what she thinks she knows about Finn, her family, and even her own heart.At Finn’s funeral, June notices a strange man lingering just beyond the crowd. A few days later, she receives a package in the mail. Inside is a beautiful teapot she recognizes from Finn’s apartment and a note from Toby, the stranger, asking for an opportunity to meet. As the two begin to spend time together, June realizes she’s not the only one who misses Finn, and if she can bring herself to trust this unexpected friend, he just might be the one she needs the most.An emotionally charged coming-of-age novel, Tell the Wolves I’m Home is a tender story of love lost and found, an unforgettable portrait of the way compassion can make us whole again. ...more", "star_rating": 2, "upc": "2a1b3d967cda1da2", "product_type": "Books", "currency": "£", "price_exceltax": 50.96, "price_incltax": 50.96, "tax": 0.0, "availability": 6, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/will-grayson-will-grayson-will-grayson-will-grayson_419/index.html", "url_md5": "http://books.toscrape.com/catalogue/will-grayson-will-grayson-will-grayson-will-grayson_419/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/b9/e6/b9e66a23fe4b95c426409bad86058152.jpg"], "title": "Will Grayson, Will Grayson (Will Grayson, Will Grayson)", "description": "Will Grayson meets Will Grayson. One cold night, in a most unlikely corner of Chicago, two strangers are about to cross paths. From that moment on, their world will collide and lives intertwine.It's not that far from Evanston to Naperville, but Chicago suburbanites Will Grayson and Will Grayson might as well live on different planets. When fate delivers them both to the sa Will Grayson meets Will Grayson. One cold night, in a most unlikely corner of Chicago, two strangers are about to cross paths. From that moment on, their world will collide and lives intertwine.It's not that far from Evanston to Naperville, but Chicago suburbanites Will Grayson and Will Grayson might as well live on different planets. When fate delivers them both to the same surprising crossroads, the Will Graysons find their lives overlapping and hurtling in new and unexpected directions. With a push from friends new and old - including the massive, and massively fabulous, Tiny Cooper, offensive lineman and musical theater auteur extraordinaire - Will and Will begin building toward respective romantic turns-of-heart and the epic production of history's most awesome high school musical. ...more", "star_rating": 4, "upc": "e75f3ae1da1cc652", "product_type": "Books", "currency": "£", "price_exceltax": 47.31, "price_incltax": 47.31, "tax": 0.0, "availability": 5, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/world-without-end-the-pillars-of-the-earth-2_420/index.html", "url_md5": "http://books.toscrape.com/catalogue/world-without-end-the-pillars-of-the-earth-2_420/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/58/b5/58b5730dd82cbcf6560cf0ab8b56cd9f.jpg"], "title": "World Without End (The Pillars of the Earth #2)", "description": "Eighteen years after the publication of The Pillars of the Earth, Ken Follett has written the the long awaited sequel, World Without End. World Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are agai Eighteen years after the publication of The Pillars of the Earth, Ken Follett has written the the long awaited sequel, World Without End. World Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are again at the center of a web of love and hate, greed and pride, ambition and revenge, but this sequel stands on its own. This time, the men and women among an extraordinary cast of characters find themselves at a crossroad of new ideas -- about medicine, commerce, architecture, and justice. In a world where proponents of the old ways fiercely battle those with progressive minds, the intrigue and tension quickly reach a boiling point against the devastating backdrop of the greatest natural disaster ever to strike the human race: the Black Death. ...more", "star_rating": 4, "upc": "2e5b4ff08a75fd02", "product_type": "Books", "currency": "£", "price_exceltax": 32.97, "price_incltax": 32.97, "tax": 0.0, "availability": 5, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-darkest-corners_399/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-darkest-corners_399/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/8c/64/8c64037f38663260b91c275078ee882d.jpg"], "title": "The Darkest Corners", "description": "The Darkest Corners is a psychological thriller about the lies little girls tell, and the deadly truths those lies become.There are ghosts around every corner in Fayette, Pennsylvania. Tessa left when she was nine and has been trying ever since not to think about it after what happened there that last summer. Memories of things so dark will burn themselves into your mind i The Darkest Corners is a psychological thriller about the lies little girls tell, and the deadly truths those lies become.There are ghosts around every corner in Fayette, Pennsylvania. Tessa left when she was nine and has been trying ever since not to think about it after what happened there that last summer. Memories of things so dark will burn themselves into your mind if you let them.Callie never left. She moved to another house, so she doesn’t have to walk those same halls, but then Callie always was the stronger one. She can handle staring into the faces of her demons—and if she parties hard enough, maybe one day they’ll disappear for good.Tessa and Callie have never talked about what they saw that night. After the trial, Callie drifted and Tessa moved, and childhood friends just have a way of losing touch.But ever since she left, Tessa has had questions. Things have never quite added up. And now she has to go back to Fayette—to Wyatt Stokes, sitting on death row; to Lori Cawley, Callie’s dead cousin; and to the one other person who may be hiding the truth.Only the closer Tessa gets to the truth, the closer she gets to a killer—and this time, it won’t be so easy to run away. ...more", "star_rating": 5, "upc": "c4182bdb53e2459a", "product_type": "Books", "currency": "£", "price_exceltax": 11.33, "price_incltax": 11.33, "tax": 0.0, "availability": 5, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-dream-thieves-the-raven-cycle-2_400/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-dream-thieves-the-raven-cycle-2_400/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/77/1a/771a0d24c0ed726761a4ad4a4327e7d8.jpg"], "title": "The Dream Thieves (The Raven Cycle #2)", "description": "If you could steal things from dreams, what would you take?Ronan Lynch has secrets. Some he keeps from others. Some he keeps from himself.One secret: Ronan can bring things out of his dreams.And sometimes he's not the only one who wants those things.Ronan is one of the raven boys—a group of friends, practically brothers, searching for a dead king named Glendower, who they If you could steal things from dreams, what would you take?Ronan Lynch has secrets. Some he keeps from others. Some he keeps from himself.One secret: Ronan can bring things out of his dreams.And sometimes he's not the only one who wants those things.Ronan is one of the raven boys—a group of friends, practically brothers, searching for a dead king named Glendower, who they think is hidden somewhere in the hills by their elite private school, Aglionby Academy. The path to Glendower has long lived as an undercurrent beneath town. But now, like Ronan's secrets, it is beginning to rise to the surface—changing everything in its wake.Of The Raven Boys, Entertainment Weekly wrote, \"Maggie Stiefvater's can't-put-it-down paranormal adventure will leave you clamoring for book two.\" Now the second book is here, with the same wild imagination, dark romance, and heart-stopping twists that only Maggie Stiefvater can conjure. ...more", "star_rating": 1, "upc": "fec06f52054ea900", "product_type": "Books", "currency": "£", "price_exceltax": 34.5, "price_incltax": 34.5, "tax": 0.0, "availability": 5, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/if-i-stay-if-i-stay-1_379/index.html", "url_md5": "http://books.toscrape.com/catalogue/if-i-stay-if-i-stay-1_379/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/c2/62/c262c55a104878043319173d79986c89.jpg"], "title": "If I Stay (If I Stay #1)", "description": "Librarian note: an alternate cover for this edition can be found here.Just listen, Adam says with a voice that sounds like shrapnel.I open my eyes wide now.I sit up as much as I can.And I listen.Stay, he says.Choices. Seventeen-year-old Mia is faced with some tough ones: Stay true to her first love—music—even if it means losing her boyfriend and leaving her family and frie Librarian note: an alternate cover for this edition can be found here.Just listen, Adam says with a voice that sounds like shrapnel.I open my eyes wide now.I sit up as much as I can.And I listen.Stay, he says.Choices. Seventeen-year-old Mia is faced with some tough ones: Stay true to her first love—music—even if it means losing her boyfriend and leaving her family and friends behind?Then one February morning Mia goes for a drive with her family, and in an instant, everything changes. Suddenly, all the choices are gone, except one. And it's the only one that matters.If I Stay is a heartachingly beautiful book about the power of love, the true meaning of family, and the choices we all make. ...more", "star_rating": 5, "upc": "7284d85428305f5a", "product_type": "Books", "currency": "£", "price_exceltax": 38.13, "price_incltax": 38.13, "tax": 0.0, "availability": 5, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/isla-and-the-happily-ever-after-anna-and-the-french-kiss-3_380/index.html", "url_md5": "http://books.toscrape.com/catalogue/isla-and-the-happily-ever-after-anna-and-the-french-kiss-3_380/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/61/ff/61ffcc9619675c79b1f0b568d6ee870c.jpg"], "title": "Isla and the Happily Ever After (Anna and the French Kiss #3)", "description": "Love ignites in the City That Never Sleeps, but can it last? Hopeless romantic Isla has had a crush on introspective cartoonist Josh since their first year at the School of America in Paris. And after a chance encounter in Manhattan over the summer, romance might be closer than Isla imagined. But as they begin their senior year back in France, Isla and Josh are forced to c Love ignites in the City That Never Sleeps, but can it last? Hopeless romantic Isla has had a crush on introspective cartoonist Josh since their first year at the School of America in Paris. And after a chance encounter in Manhattan over the summer, romance might be closer than Isla imagined. But as they begin their senior year back in France, Isla and Josh are forced to confront the challenges every young couple must face, including family drama, uncertainty about their college futures, and the very real possibility of being apart. Featuring cameos from fan-favorites Anna, Étienne, Lola, and Cricket, this sweet and sexy story of true love—set against the stunning backdrops of New York City, Paris, and Barcelona—is a swoonworthy conclusion to Stephanie Perkins’s beloved series. ...more", "star_rating": 5, "upc": "45045146dbf7b009", "product_type": "Books", "currency": "£", "price_exceltax": 48.13, "price_incltax": 48.13, "tax": 0.0, "availability": 5, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/a-girls-guide-to-moving-on-new-beginnings-2_359/index.html", "url_md5": "http://books.toscrape.com/catalogue/a-girls-guide-to-moving-on-new-beginnings-2_359/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/17/94/17940ad8d367ea5f28db57e7fc32dac9.jpg"], "title": "A Girl's Guide to Moving On (New Beginnings #2)", "description": "NEW YORK TIMES BESTSELLER • In this powerful and uplifting novel, a mother and her daughter-in-law bravely leave their troubled marriages and face the challenge of starting over. Leaning on each other, Nichole and Leanne discover that their inner strength and capacity for love are greater than they ever imagined. When Nichole discovers that her husband, Jake, has been unfa NEW YORK TIMES BESTSELLER • In this powerful and uplifting novel, a mother and her daughter-in-law bravely leave their troubled marriages and face the challenge of starting over. Leaning on each other, Nichole and Leanne discover that their inner strength and capacity for love are greater than they ever imagined. When Nichole discovers that her husband, Jake, has been unfaithful, the illusion of her perfect life is indelibly shattered. While juggling her young son, a new job, and volunteer work, Nichole meets Rocco, who is the opposite of Jake in nearly every way. Though blunt-spoken and rough around the edges, Rocco proves to be a dedicated father and thoughtful friend. But just as their relationship begins to blossom, Jake wagers everything on winning Nichole back—including their son Owen’s happiness. Somehow, Nichole must find the courage to defy her fears and follow her heart, with far-reaching consequences for them all. Leanne has quietly ignored her husband’s cheating for decades, but is jolted into action by the echo of Nichole’s all-too-familiar crisis. While volunteering as a teacher of English as a second language, Leanne meets Nikolai, a charming, talented baker from Ukraine. Resolved to avoid the heartache and complications of romantic entanglements, Leanne nonetheless finds it difficult to resist Nikolai’s effusive overtures—until an unexpected tragedy tests the very fabric of her commitments. An inspiring novel of friendship, reinvention, and hope, A Girl’s Guide to Moving On affirms the ability of every woman to forge a new path, believe in love, and fearlessly find happiness.Praise for A Girl’s Guide to Moving On “Debbie Macomber’s finest novel. Betrayal and sorrow can happen in any stage of life and, in this wonderful story, her very nimble hands weave a spectacular kaleidoscope of courage, struggles, and finally joyous redemption and reinvention. Macomber totally understands the human heart. I absolutely loved it!”—Dorothea Benton Frank, New York Times bestselling author of All the Single Ladies “Whispers a message of love, hope, and, yes, reinvention to every woman who has ever wondered ‘Is that all there is?’ I predict every diehard Macomber fan—as well as legions of readers new to the Macomber magic—will be cheering for Leanne and Nichole, and clamoring for more, more, more.”—Mary Kay Andrews, New York Times bestselling author of Beach Town, Ladies’ Night, and Summer Rental “Macomber is a master at pulling heartstrings, and readers will delight in this heartwarming story of friendship, love, and second chances. Leanne, Nichole, Rocco, and Nikolai will renew your faith in love and hope. The perfect read curled up in front of the fire or on a beach, it’s as satisfying as a slice of freshly baked bread—wholesome, pleasantly filling, and delicious.”—Karen White, New York Times bestselling author of Flight Patterns “Beloved author Debbie Macomber reaches new heights in this wise and beautiful novel. It’s the kind of reading experience that comes along only rarely, bearing the hallmarks of a classic. The timeless wisdom in these pages will stay with you long after the book is closed.”—Susan Wiggs, #1 New York Times bestselling author of Starlight on Willow Lake “Debbie dazzles! A wonderful story of friendship, forgiveness and the power of love. I devoured every page!”—Susan Mallery, #1 New York Times bestselling author of The Friends We Keep ...more", "star_rating": 1, "upc": "cf3b86489890b9f2", "product_type": "Books", "currency": "£", "price_exceltax": 31.3, "price_incltax": 31.3, "tax": 0.0, "availability": 5, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/alight-the-generations-trilogy-2_360/index.html", "url_md5": "http://books.toscrape.com/catalogue/alight-the-generations-trilogy-2_360/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/43/74/43749a90eed0e03d9975116ad44fbde3.jpg"], "title": "Alight (The Generations Trilogy #2)", "description": "Alight is the second installment in the YA sci-fi adventure trilogy by New York Times bestselling author Scott Sigler, hot on the heels of Alive.Alight reveals to readers the further adventures of Em, Spingate, O’Malley, Bishop, and the other young heroes introduced in Alive. In Alive, Em fought to assert herself as leader and her friends tried to comprehend their own myst Alight is the second installment in the YA sci-fi adventure trilogy by New York Times bestselling author Scott Sigler, hot on the heels of Alive.Alight reveals to readers the further adventures of Em, Spingate, O’Malley, Bishop, and the other young heroes introduced in Alive. In Alive, Em fought to assert herself as leader and her friends tried to comprehend their own mysterious identity; now she must wrestle not with the challenge of winning power but the grave responsibility of having assumed it, and she and her friends must contend with a grim fact: the revelation of their identity is not an answer but another question—and one with terrifying implications. ...more", "star_rating": 4, "upc": "d9290e99f189ce84", "product_type": "Books", "currency": "£", "price_exceltax": 58.59, "price_incltax": 58.59, "tax": 0.0, "availability": 5, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/paper-and-fire-the-great-library-2_339/index.html", "url_md5": "http://books.toscrape.com/catalogue/paper-and-fire-the-great-library-2_339/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/b6/3b/b63bd741fc6ada1e60a33db14bde0277.jpg"], "title": "Paper and Fire (The Great Library #2)", "description": "In Ink and Bone, New York Times bestselling author Rachel Caine introduced a world where knowledge is power, and power corrupts absolutely. Now, she continues the story of those who dare to defy the Great Library—and rewrite history…With an iron fist, The Great Library controls the knowledge of the world, ruthlessly stamping out all rebellion, forbidding the personal owner In Ink and Bone, New York Times bestselling author Rachel Caine introduced a world where knowledge is power, and power corrupts absolutely. Now, she continues the story of those who dare to defy the Great Library—and rewrite history…With an iron fist, The Great Library controls the knowledge of the world, ruthlessly stamping out all rebellion, forbidding the personal ownership of books in the name of the greater good.Jess Brightwell has survived his introduction to the sinister, seductive world of the Library, but serving in its army is nothing like he envisioned. His life and the lives of those he cares for have been altered forever. His best friend is lost, and Morgan, the girl he loves, is locked away in the Iron Tower and doomed to a life apart.Embarking on a mission to save one of their own, Jess and his band of allies make one wrong move and suddenly find themselves hunted by the Library’s deadly automata and forced to flee Alexandria, all the way to London.But Jess’s home isn’t safe anymore. The Welsh army is coming, London is burning, and soon, Jess must choose between his friends, his family, or the Library willing to sacrifice anything and anyone in the search for ultimate control… ...more", "star_rating": 5, "upc": "ae884ac655d6ee3e", "product_type": "Books", "currency": "£", "price_exceltax": 49.45, "price_incltax": 49.45, "tax": 0.0, "availability": 4, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/shopaholic-ties-the-knot-shopaholic-3_340/index.html", "url_md5": "http://books.toscrape.com/catalogue/shopaholic-ties-the-knot-shopaholic-3_340/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/d0/f8/d0f8f438caa5e7adc1c727da4f06ca64.jpg"], "title": "Shopaholic Ties the Knot (Shopaholic #3)", "description": "Life has been good for Becky Bloomwood: She’s become the best personal shopper at Barneys, she and her successful entrepreneurial boyfriend, Luke, are living happily in Manhattan’s West Village, and her new next-door neighbor is a fashion designer! But with her best friend, Suze, engaged, how can Becky fail to notice that her own ring finger is bare? Not that she’s been th Life has been good for Becky Bloomwood: She’s become the best personal shopper at Barneys, she and her successful entrepreneurial boyfriend, Luke, are living happily in Manhattan’s West Village, and her new next-door neighbor is a fashion designer! But with her best friend, Suze, engaged, how can Becky fail to notice that her own ring finger is bare? Not that she’s been thinking of marriage (or diamonds) or anything . . . Then Luke proposes! Bridal registries dance in Becky’s head. Problem is, two other people are planning her wedding: Becky’s overjoyed mother has been waiting forever to host a backyard wedding, with the bride resplendent in Mum’s frilly old gown. While Luke’s high-society mother is insisting on a glamorous, all-expenses-paid affair at the Plaza. Both weddings for the same day. And Becky can’t seem to turn down either one. Can everyone’s favorite shopaholic tie the knot before everything unravels? ...more", "star_rating": 5, "upc": "38199c5d7da0c0ef", "product_type": "Books", "currency": "£", "price_exceltax": 48.39, "price_incltax": 48.39, "tax": 0.0, "availability": 4, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/far-from-true-promise-falls-trilogy-2_320/index.html", "url_md5": "http://books.toscrape.com/catalogue/far-from-true-promise-falls-trilogy-2_320/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/9c/aa/9caacda3ff43984447ee22712e7e9ca9.jpg"], "title": "Far From True (Promise Falls Trilogy #2)", "description": "New York Times and #1 international bestselling author Linwood Barclay delivers the second spine-chilling thriller set in the troubled town of Promise Falls, following the electrifying cliffhanger ending of Broken Promise... After the screen of a run-down drive-in movie theater collapses and kills fourpeople, the daughter of one of the victims asks private investigator Ca New York Times and #1 international bestselling author Linwood Barclay delivers the second spine-chilling thriller set in the troubled town of Promise Falls, following the electrifying cliffhanger ending of Broken Promise...   After the screen of a run-down drive-in movie theater collapses and kills four people, the daughter of one of the victims asks private investigator Cal Weaver to look into a recent break-in at her father’s house. Cal discovers a hidden basement room where it’s clear that salacious activities have taken place—as well as evidence of missing DVDs. But his investigation soon becomes more complicated when he realizes it may not be discs the thief was actually interested in....   Meanwhile, Detective Barry Duckworth is still trying to solve two murders—one of which is three years old—he believes are connected, since each featured a similar distinctive wound.   As the lies begin to unravel, Cal is headed straight into the heart of a dark secret as his search uncovers more startling truths about Promise Falls. And when yet another murder happens, Cal and Barry are both driven to pursue their investigations, no matter where they lead. Evil deeds long thought buried are about to haunt the residents of this town—as the sins of the past and present collide with terrifying results. ...more", "star_rating": 2, "upc": "ad15a9a139919918", "product_type": "Books", "currency": "£", "price_exceltax": 34.93, "price_incltax": 34.93, "tax": 0.0, "availability": 4, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/dark-lover-black-dagger-brotherhood-1_319/index.html", "url_md5": "http://books.toscrape.com/catalogue/dark-lover-black-dagger-brotherhood-1_319/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/d8/bd/d8bdea8d4e7db9af8e0cb1b36db448d2.jpg"], "title": "Dark Lover (Black Dagger Brotherhood #1)", "description": "Also see: Alternate Cover Editions for this ISBN [ACE] ACE #1 In the shadows of the night in Caldwell, New York, there's a deadly turf war going on between vampires and their slayers. There exists a secret band of brothers like no other-six vampire warriors, defenders of their race. Yet none of them relishes killing more than Wrath, the leader of The Black Dagger Brotherh Also see: Alternate Cover Editions for this ISBN [ACE] ACE #1 In the shadows of the night in Caldwell, New York, there's a deadly turf war going on between vampires and their slayers. There exists a secret band of brothers like no other-six vampire warriors, defenders of their race. Yet none of them relishes killing more than Wrath, the leader of The Black Dagger Brotherhood.The only purebred vampire left on earth, Wrath has a score to settle with the slayers who murdered his parents centuries ago. But, when one of his most trusted fighters is killed-leaving his half-breed daughter unaware of his existence or her fate-Wrath must usher her into the world of the undead-a world of sensuality beyond her wildest dreams.Also see: Alternate Cover Editions for this ISBN [ACE] ACE #1 ...more", "star_rating": 1, "upc": "2b69d289279aabfd", "product_type": "Books", "currency": "£", "price_exceltax": 12.87, "price_incltax": 12.87, "tax": 0.0, "availability": 4, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/voyager-outlander-3_299/index.html", "url_md5": "http://books.toscrape.com/catalogue/voyager-outlander-3_299/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/6e/22/6e22497cbecedef59be86d1328e4b044.jpg"], "title": "Voyager (Outlander #3)", "description": "From the author of the breathtaking bestsellers Outlander and Dragonfly in Amber, the extraordinary saga continues.Their passionate encounter happened long ago by whatever measurement Claire Randall took. Two decades before, she had traveled back in time and into the arms of a gallant eighteenth-century Scot named Jamie Fraser. Then she returned to her own century to bear From the author of the breathtaking bestsellers Outlander and Dragonfly in Amber, the extraordinary saga continues.Their passionate encounter happened long ago by whatever measurement Claire Randall took. Two decades before, she had traveled back in time and into the arms of a gallant eighteenth-century Scot named Jamie Fraser. Then she returned to her own century to bear his child, believing him dead in the tragic battle of Culloden. Yet his memory has never lessened its hold on her... and her body still cries out for him in her dreams.Then Claire discovers that Jamie survived. Torn between returning to him and staying with their daughter in her own era, Claire must choose her destiny. And as time and space come full circle, she must find the courage to face the passion and pain awaiting her...the deadly intrigues raging in a divided Scotland... and the daring voyage into the dark unknown that can reunite or forever doom her timeless love. ...more", "star_rating": 5, "upc": "7feac4000cbc5859", "product_type": "Books", "currency": "£", "price_exceltax": 21.07, "price_incltax": 21.07, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/walk-the-edge-thunder-road-2_300/index.html", "url_md5": "http://books.toscrape.com/catalogue/walk-the-edge-thunder-road-2_300/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/3f/c5/3fc5fbb8ab3099a5fae8f5d180605905.jpg"], "title": "Walk the Edge (Thunder Road #2)", "description": "One moment of recklessness will change their worlds.Smart. Responsible. That's seventeen-year-old Breanna's role in her large family, and heaven forbid she put a toe out of line. Until one night of shockingly un-Breanna-like behavior puts her into a vicious cyber-bully's line of fire—and brings fellow senior Thomas \"Razor\" Turner into her life. Razor lives for the Reign of One moment of recklessness will change their worlds.Smart. Responsible. That's seventeen-year-old Breanna's role in her large family, and heaven forbid she put a toe out of line. Until one night of shockingly un-Breanna-like behavior puts her into a vicious cyber-bully's line of fire—and brings fellow senior Thomas \"Razor\" Turner into her life. Razor lives for the Reign of Terror motorcycle club, and good girls like Breanna just don't belong. But when he learns she's being blackmailed over a compromising picture of the two of them—a picture that turns one unexpected and beautiful moment into ugliness—he knows it's time to step outside the rules. And so they make a pact: he'll help her track down her blackmailer, and in return she'll help him seek answers to the mystery that's haunted him—one that not even his club brothers have been willing to discuss. But the more time they spend together, the more their feelings grow. And suddenly they're both walking the edge of discovering who they really are, what they want, and where they're going from here. ...more", "star_rating": 3, "upc": "0e4e2d31c2fb3aad", "product_type": "Books", "currency": "£", "price_exceltax": 32.36, "price_incltax": 32.36, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-silkworm-cormoran-strike-2_280/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-silkworm-cormoran-strike-2_280/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/fa/d2/fad227281b25d606782218a33323991b.jpg"], "title": "The Silkworm (Cormoran Strike #2)", "description": "Private investigator Cormoran Strike returns in a new mystery from Robert Galbraith, author of the #1 international bestseller The Cuckoo's Calling.When novelist Owen Quine goes missing, his wife calls in private detective Cormoran Strike. At first, Mrs. Quine just thinks her husband has gone off by himself for a few days—as he has done before—and she wants Strike to find Private investigator Cormoran Strike returns in a new mystery from Robert Galbraith, author of the #1 international bestseller The Cuckoo's Calling.When novelist Owen Quine goes missing, his wife calls in private detective Cormoran Strike. At first, Mrs. Quine just thinks her husband has gone off by himself for a few days—as he has done before—and she wants Strike to find him and bring him home.But as Strike investigates, it becomes clear that there is more to Quine's disappearance than his wife realizes. The novelist has just completed a manuscript featuring poisonous pen-portraits of almost everyone he knows. If the novel were to be published, it would ruin lives—meaning that there are a lot of people who might want him silenced.When Quine is found brutally murdered under bizarre circumstances, it becomes a race against time to understand the motivation of a ruthless killer, a killer unlike any Strike has encountered before... ...more", "star_rating": 5, "upc": "f06039c29b5891fa", "product_type": "Books", "currency": "£", "price_exceltax": 23.05, "price_incltax": 23.05, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-sandman-vol-3-dream-country-the-sandman-volumes-3_279/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-sandman-vol-3-dream-country-the-sandman-volumes-3_279/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/df/96/df96b9a9739d2421620bfb3622f3c2d0.jpg"], "title": "The Sandman, Vol. 3: Dream Country (The Sandman (volumes) #3)", "description": "The third volume of the Sandman collection is a series of four short comic book stories. In each of these otherwise unrelated stories, Morpheus serves only as a minor character. Here we meet the mother of Morpheus's son, find out what cats dream about, and discover the true origin behind Shakespeare's A Midsummer's Night Dream. The latter won a World Fantasy Award for best The third volume of the Sandman collection is a series of four short comic book stories. In each of these otherwise unrelated stories, Morpheus serves only as a minor character. Here we meet the mother of Morpheus's son, find out what cats dream about, and discover the true origin behind Shakespeare's A Midsummer's Night Dream. The latter won a World Fantasy Award for best short story, the first time a comic book was given that honor. collecting The Sandman #17–20 ...more", "star_rating": 5, "upc": "91eb9605998a7c03", "product_type": "Books", "currency": "£", "price_exceltax": 55.55, "price_incltax": 55.55, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-lean-startup-how-todays-entrepreneurs-use-continuous-innovation-to-create-radically-successful-businesses_260/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-lean-startup-how-todays-entrepreneurs-use-continuous-innovation-to-create-radically-successful-businesses_260/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/52/6e/526e9f360da288db64ca70c89cdbcaa9.jpg"], "title": "The Lean Startup: How Today's Entrepreneurs Use Continuous Innovation to Create Radically Successful Businesses", "description": "Most startups fail. But many of those failures are preventable. The Lean Startup is a new approach being adopted across the globe, changing the way companies are built and new products are launched. Eric Ries defines a startup asan organization dedicated to creating something new under conditions of extreme uncertainty. This is just as true for one person in a garage or a Most startups fail. But many of those failures are preventable.  The Lean Startup is a new approach being adopted across the globe, changing the way companies are built and new products are launched. Eric Ries defines a startup as an organization dedicated to creating something new under conditions of extreme uncertainty. This is just as true for one person in a garage or a group of seasoned professionals in a Fortune 500 boardroom. What they have in common is a mission to penetrate that fog of uncertainty to discover a successful path to a sustainable business. The Lean Startup approach fosters companies that are both more capital efficient and that leverage human creativity more effectively.  Inspired by lessons from lean manufacturing, it relies on “validated learning,” rapid scientific experimentation, as well as a number of counter-intuitive practices that shorten product development cycles, measure actual progress without resorting to vanity metrics, and learn what customers really want. It enables a company to shift directions with agility, altering plans inch by inch, minute by minute. Rather than wasting time creating elaborate business plans, The Lean Startup offers entrepreneurs - in companies of all sizes - a way to test their vision continuously, to adapt and adjust before it’s too late. Ries provides a scientific approach to creating and managing successful startups in a age when companies need to innovate more than ever. ...more", "star_rating": 3, "upc": "70c7c3ca7f9b2728", "product_type": "Books", "currency": "£", "price_exceltax": 33.92, "price_incltax": 33.92, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-last-painting-of-sara-de-vos_259/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-last-painting-of-sara-de-vos_259/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/1c/e4/1ce4c2573d65ebdc3c85d9a6592d57b1.jpg"], "title": "The Last Painting of Sara de Vos", "description": "This is what we long for: the profound pleasure of being swept into vivid new worlds, worlds peopled by characters so intriguing and real that we can't shake them, even long after the reading's done. In his earlier, award-winning novels, Dominic Smith demonstrated a gift for coaxing the past to life. Now, in The Last Painting of Sara de Vos, he deftly bridges the historica This is what we long for: the profound pleasure of being swept into vivid new worlds, worlds peopled by characters so intriguing and real that we can't shake them, even long after the reading's done. In his earlier, award-winning novels, Dominic Smith demonstrated a gift for coaxing the past to life. Now, in The Last Painting of Sara de Vos, he deftly bridges the historical and the contemporary, tracking a collision course between a rare landscape by a female Dutch painter of the golden age, an inheritor of the work in 1950s Manhattan, and a celebrated art historian who painted a forgery of it in her youth.In 1631, Sara de Vos is admitted as a master painter to the Guild of St. Luke's in Holland, the first woman to be so recognized. Three hundred years later, only one work attributed to de Vos is known to remain--a haunting winter scene, At the Edge of a Wood, which hangs over the bed of a wealthy descendant of the original owner. An Australian grad student, Ellie Shipley, struggling to stay afloat in New York, agrees to paint a forgery of the landscape, a decision that will haunt her. Because now, half a century later, she's curating an exhibit of female Dutch painters, and both versions threaten to arrive. As the three threads intersect, The Last Painting of Sara de Vos mesmerizes while it grapples with the demands of the artistic life, showing how the deceits of the past can forge the present. ...more", "star_rating": 2, "upc": "476c7972e9b41891", "product_type": "Books", "currency": "£", "price_exceltax": 55.55, "price_incltax": 55.55, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-cuckoos-calling-cormoran-strike-1_239/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-cuckoos-calling-cormoran-strike-1_239/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/72/ec/72ec24f082aba608ca37bc3aeaf57317.jpg"], "title": "The Cuckoo's Calling (Cormoran Strike #1)", "description": "A BRILLIANT DEBUT MYSTERY IN A CLASSIC VEIN: DETECTIVE CORMORAN STRIKE INVESTIGATES A SUPERMODEL'S SUICIDE. After losing his leg to a land mine in Afghanistan, Cormoran Strike is barely scraping by as a private investigator. Strike is down to one client, and creditors are calling. He has also just broken up with his longtime girlfriend and is living in his office.Then John A BRILLIANT DEBUT MYSTERY IN A CLASSIC VEIN: DETECTIVE CORMORAN STRIKE INVESTIGATES A SUPERMODEL'S SUICIDE. After losing his leg to a land mine in Afghanistan, Cormoran Strike is barely scraping by as a private investigator. Strike is down to one client, and creditors are calling. He has also just broken up with his longtime girlfriend and is living in his office.Then John Bristow walks through his door with an amazing story: His sister, the legendary supermodel Lula Landry, known to her friends as the Cuckoo, famously fell to her death a few months earlier. The police ruled it a suicide, but John refuses to believe that. The case plunges Strike into the world of multimillionaire beauties, rock-star boyfriends, and desperate designers, and it introduces him to every variety of pleasure, enticement, seduction, and delusion known to man.You may think you know detectives, but you've never met one quite like Strike. You may think you know about the wealthy and famous, but you've never seen them under an investigation like this. Introducing Cormoran Strike, this is the acclaimed first crime novel by J.K. Rowling, writing under the pseudonym Robert Galbraith. ...more", "star_rating": 1, "upc": "1be6d3b121865edb", "product_type": "Books", "currency": "£", "price_exceltax": 19.21, "price_incltax": 19.21, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-da-vinci-code-robert-langdon-2_240/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-da-vinci-code-robert-langdon-2_240/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/90/81/90810ccd85e7f49b9040246800a19b44.jpg"], "title": "The Da Vinci Code (Robert Langdon #2)", "description": "An ingenious code hidden in the works of Leonardo da Vinci. A desperate race through the cathedrals and castles of Europe. An astonishing truth concealed for centuries . . . unveiled at last.While in Paris, Harvard symbologist Robert Langdon is awakened by a phone call in the dead of the night. The elderly curator of the Louvre has been murdered inside the museum, his body An ingenious code hidden in the works of Leonardo da Vinci. A desperate race through the cathedrals and castles of Europe. An astonishing truth concealed for centuries . . . unveiled at last.While in Paris, Harvard symbologist Robert Langdon is awakened by a phone call in the dead of the night. The elderly curator of the Louvre has been murdered inside the museum, his body covered in baffling symbols. As Langdon and gifted French cryptologist Sophie Neveu sort through the bizarre riddles, they are stunned to discover a trail of clues hidden in the works of Leonardo da Vinci—clues visible for all to see and yet ingeniously disguised by the painter.Even more startling, the late curator was involved in the Priory of Sion—a secret society whose members included Sir Isaac Newton, Victor Hugo, and Da Vinci—and he guarded a breathtaking historical secret. Unless Langdon and Neveu can decipher the labyrinthine puzzle—while avoiding the faceless adversary who shadows their every move—the explosive, ancient truth will be lost forever. ...more", "star_rating": 2, "upc": "dabf11918b48b40c", "product_type": "Books", "currency": "£", "price_exceltax": 22.96, "price_incltax": 22.96, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/seven-days-in-the-art-world_220/index.html", "url_md5": "http://books.toscrape.com/catalogue/seven-days-in-the-art-world_220/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/92/2f/922f6fcd3282a0da76cc14fc13ae2411.jpg"], "title": "Seven Days in the Art World", "description": "Named one of the best art books of 2008 by The New York Times and The Sunday Times [London]: “An indelible portrait of a peculiar society.”—Vogue The art market has been booming. Museum attendance is surging. More people than ever call themselves artists. Contemporary art has become a mass entertainment, a luxury good, a job description, and, for some, a kind of alternativ Named one of the best art books of 2008 by The New York Times and The Sunday Times [London]: “An indelible portrait of a peculiar society.”—Vogue The art market has been booming. Museum attendance is surging. More people than ever call themselves artists. Contemporary art has become a mass entertainment, a luxury good, a job description, and, for some, a kind of alternative religion. In a series of beautifully paced narratives, Sarah Thornton investigates the drama of a Christie's auction, the workings in Takashi Murakami's studios, the elite at the Basel Art Fair, the eccentricities of Artforum magazine, the competition behind an important art prize, life in a notorious art-school seminar, and the wonderland of the Venice Biennale. She reveals the new dynamics of creativity, taste, status, money, and the search for meaning in life. A judicious and juicy account of the institutions that have the power to shape art history, based on hundreds of interviews with high-profile players, Thornton's entertaining ethnography will change the way you look at contemporary culture. 8 illustrations. ...more", "star_rating": 2, "upc": "07806456878931bc", "product_type": "Books", "currency": "£", "price_exceltax": 52.33, "price_incltax": 52.33, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/seven-brief-lessons-on-physics_219/index.html", "url_md5": "http://books.toscrape.com/catalogue/seven-brief-lessons-on-physics_219/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/ae/f9/aef933758e39ba5e4327b2152478bb1a.jpg"], "title": "Seven Brief Lessons on Physics", "description": "Everything you need to know about the beauty ofmodern physics in less than 100 pages.In seven brief lessons, Italian theoretical physicist Carlo Rovelli guides readers with admirable clarity through the most transformative physics breakthroughs of the twentieth and twenty-first centuries. This playful, entertaining and mind-bending introduction to modern physics, already a Everything you need to know about the beauty of modern physics in less than 100 pages.In seven brief lessons, Italian theoretical physicist Carlo Rovelli guides readers with admirable clarity through the most transformative physics breakthroughs of the twentieth and twenty-first centuries. This playful, entertaining and mind-bending introduction to modern physics, already a major bestseller in Italy, explains general relativity, quantum mechanics, elementary particles, gravity, black holes, the complex architecture of the universe, and the role of humans in the strange world Rovelli describes. This is a book about the joy of discovery. It takes readers to the frontiers of our knowledge: to the most minute reaches of the fabric of space, back to the origins of the cosmos, and into the workings of our minds. “Here, on the edge of what we know, in contact with the ocean of the unknown, shines the mystery and the beauty of the world,” Rovelli writes. “And it’s breathtaking.” ...more", "star_rating": 4, "upc": "281a244ce1954711", "product_type": "Books", "currency": "£", "price_exceltax": 30.6, "price_incltax": 30.6, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/night-the-night-trilogy-1_199/index.html", "url_md5": "http://books.toscrape.com/catalogue/night-the-night-trilogy-1_199/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/b2/45/b245b0b715de260634e66a05a024cc52.jpg"], "title": "Night (The Night Trilogy #1)", "description": "Night is a work by Elie Wiesel about his experience with his father in the Nazi German concentration camps at Auschwitz and Buchenwald in 1944–1945, at the height of the Holocaust and toward the end of the Second World War. In just over 100 pages of sparse and fragmented narrative, Wiesel writes about the death of God and his own increasing disgust with humanity, reflected Night is a work by Elie Wiesel about his experience with his father in the Nazi German concentration camps at Auschwitz and Buchenwald in 1944–1945, at the height of the Holocaust and toward the end of the Second World War. In just over 100 pages of sparse and fragmented narrative, Wiesel writes about the death of God and his own increasing disgust with humanity, reflected in the inversion of the father–child relationship as his father declines to a helpless state and Wiesel becomes his resentful teenage caregiver.Penetrating and powerful, as personal as The Diary Of Anne Frank, Night awakens the shocking memory of evil at its absolute and carries with it the unforgettable message that this horror must never be allowed to happen again. ...more", "star_rating": 1, "upc": "c4d9fce9eff3b8ba", "product_type": "Books", "currency": "£", "price_exceltax": 13.51, "price_incltax": 13.51, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/notes-from-a-small-island-notes-from-a-small-island-1_200/index.html", "url_md5": "http://books.toscrape.com/catalogue/notes-from-a-small-island-notes-from-a-small-island-1_200/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/8f/40/8f40ba4f73d2c70e0ccc15d77dc3c220.jpg"], "title": "Notes from a Small Island (Notes From a Small Island #1)", "description": "\"Suddenly, in the space of a moment, I realized what it was that I loved about Britain-which is to say, all of it.\" After nearly two decades spent on British soil, Bill Bryson - bestselling author of The Mother Tongue and Made in America-decided to return to the United States. (\"I had recently read,\" Bryson writes, \"that 3.7 million Americans believed that they had been a \"Suddenly, in the space of a moment, I realized what it was that I loved about Britain-which is to say, all of it.\" After nearly two decades spent on British soil, Bill Bryson - bestselling author of The Mother Tongue and Made in America-decided to return to the United States. (\"I had recently read,\" Bryson writes, \"that 3.7 million Americans believed that they had been abducted by aliens at one time or another,so it was clear that my people needed me.\") But before departing, he set out on a grand farewell tour of the green and kindly island that had so long been his home.Veering from the ludicrous to the endearing and back again, Notes from a Small Island is a delightfully irreverent jaunt around the unparalleled floating nation that has produced zebra crossings, Shakespeare, Twiggie Winkie's Farm, and places with names like Farleigh Wallop and Titsey. The result is an uproarious social commentary that conveys the true glory of Britain, from the satiric pen of an unapologetic Anglophile. ...more", "star_rating": 1, "upc": "cb65e49993db9a93", "product_type": "Books", "currency": "£", "price_exceltax": 40.17, "price_incltax": 40.17, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/its-never-too-late-to-begin-again-discovering-creativity-and-meaning-at-midlife-and-beyond_179/index.html", "url_md5": "http://books.toscrape.com/catalogue/its-never-too-late-to-begin-again-discovering-creativity-and-meaning-at-midlife-and-beyond_179/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/27/f5/27f54466115767b767133ee034543cb5.jpg"], "title": "It's Never Too Late to Begin Again: Discovering Creativity and Meaning at Midlife and Beyond", "description": "“The book you hold in your hands is the distillate of a quarter century’s teaching. It is my attempt to answer, ‘What next?’ for students who are embarking on their ‘second act.’”—Julia Cameron Julia Cameron has inspired millions with her bestseller on creativity,The Artist’s Way. InIt’s Never Too Late To Begin Again,she turns her eye to a segment of the population that, “The book you hold in your hands is the distillate of a quarter century’s teaching. It is my attempt to answer, ‘What next?’ for students who are embarking on their ‘second act.’”—Julia Cameron   Julia Cameron has inspired millions with her bestseller on creativity, The Artist’s Way. In It’s Never Too Late To Begin Again, she turns her eye to a segment of the population that, ironically, while they have more time to be creative, are often reluctant or intimidated by the creative process. Cameron shows readers that retirement can, in fact, be the most rich, fulfilling, and creative time of their lives. When someone retires, the newfound freedom can be quite exciting, but also daunting. The life that someone had has changed, and the life to come is yet to be defined. In this book, Cameron shows readers how cultivating their creative selves can help them navigate this new terrain. She tells the inspiring stories of retirees who discovered new artistic pursuits and passions that more than filled their days—they nurtured their souls.   A twelve-week course aimed at defining—and creating—the life you want to have as you redefine—and re-create—yourself, this book includes simple tools that will guide and inspire you to make the most of this time in your life: -  Memoir writing offers an opportunity to reflect on—and honor—past experience. This book guides you through the daunting task of writing an entire memoir, breaking it down into manageable pieces.  -  Morning Pages—private, stream-of-consciousness writing done daily—allow you to express wishes, fears, delights, resentments, and joys, which in turn, provide focus and clarity for the day at hand. -  Artist Dates encourage fun and spontaneity. -  Solo Walks quell anxiety and clear the mind.This fun, gentle, step-by-step process will help you explore your creative dreams, wishes, and desires—and help you quickly find that it’s never too late to begin again. ...more", "star_rating": 1, "upc": "d4a29356fc992879", "product_type": "Books", "currency": "£", "price_exceltax": 42.38, "price_incltax": 42.38, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/jurassic-park-jurassic-park-1_180/index.html", "url_md5": "http://books.toscrape.com/catalogue/jurassic-park-jurassic-park-1_180/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/26/9e/269e8962f39f359559a46cae86576128.jpg"], "title": "Jurassic Park (Jurassic Park #1)", "description": "A billionaire has created a technique to clone dinosaurs. From the DNA that his crack team of scientists extract, he is able to grow the dinosaurs in his laboratories and lock them away on an island behind electric fences, creating a sort of theme park. He asks a group of scientists from several different fields to come and view the park, but something goes terribly wrong A billionaire has created a technique to clone dinosaurs. From the DNA that his crack team of scientists extract, he is able to grow the dinosaurs in his laboratories and lock them away on an island behind electric fences, creating a sort of theme park. He asks a group of scientists from several different fields to come and view the park, but something goes terribly wrong when a worker on the island turns traitor and shuts down the power.Cover illustration by Chip Kidd. ...more", "star_rating": 1, "upc": "a0dd11f6abc421ec", "product_type": "Books", "currency": "£", "price_exceltax": 44.97, "price_incltax": 44.97, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/girl-in-the-blue-coat_160/index.html", "url_md5": "http://books.toscrape.com/catalogue/girl-in-the-blue-coat_160/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/15/ea/15eaabd188af8916c4a37d135f7b8952.jpg"], "title": "Girl in the Blue Coat", "description": "Amsterdam, 1943. Hanneke spends her days finding and delivering sought-after black market goods to paying customers, nights hiding the true nature of her work from her concerned parents, and every waking moment mourning her boyfriend, who was killed on the Dutch front lines when the German army invaded. Her illegal work keeps her family afloat, and Hanneke also likes to th Amsterdam, 1943. Hanneke spends her days finding and delivering sought-after black market goods to paying customers, nights hiding the true nature of her work from her concerned parents, and every waking moment mourning her boyfriend, who was killed on the Dutch front lines when the German army invaded. Her illegal work keeps her family afloat, and Hanneke also likes to think of it as a small act of rebellion against the Nazis.On a routine delivery, a client asks Hanneke for help. Expecting to hear that Mrs. Janssen wants meat or kerosene, Hanneke is shocked by the older woman’s frantic plea to find a person: a Jewish teenager Mrs. Janssen had been hiding, who has vanished without a trace from a secret room. Hanneke initially wants nothing to do with such a dangerous task but is ultimately drawn into a web of mysteries and stunning revelations—where the only way out is through.Beautifully written, intricately plotted, and meticulously researched, Girl in the Blue Coat is an extraordinary, unforgettable story of bravery, grief, and love in impossible times. ...more", "star_rating": 2, "upc": "41fc5dce044f16f5", "product_type": "Books", "currency": "£", "price_exceltax": 46.83, "price_incltax": 46.83, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/fruits-basket-vol-3-fruits-basket-3_159/index.html", "url_md5": "http://books.toscrape.com/catalogue/fruits-basket-vol-3-fruits-basket-3_159/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/85/d2/85d2821dbc2d274f516582449199015e.jpg"], "title": "Fruits Basket, Vol. 3 (Fruits Basket #3)", "description": "A family with an ancient curse...And the girl who will change their lives forever...It's Valentines Day and you know what that means - lots of chocolates for the cutest boys at school! In this case, it's a pretty close tie between hot-headed Kyo Sohma and \"Prince Charming\" Yuki Sohma. Of course the kind-hearted Tohru, guest of the Sohma family, has chocolates for everyone! A family with an ancient curse...And the girl who will change their lives forever...It's Valentines Day and you know what that means - lots of chocolates for the cutest boys at school! In this case, it's a pretty close tie between hot-headed Kyo Sohma and \"Prince Charming\" Yuki Sohma. Of course the kind-hearted Tohru, guest of the Sohma family, has chocolates for everyone! But when White Day comes around, what will the Sohma family give her in return? ...more", "star_rating": 2, "upc": "d5f5a122a593b580", "product_type": "Books", "currency": "£", "price_exceltax": 45.17, "price_incltax": 45.17, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/cinder-the-lunar-chronicles-1_139/index.html", "url_md5": "http://books.toscrape.com/catalogue/cinder-the-lunar-chronicles-1_139/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/55/2d/552d4630bed694b33b042990e30722d3.jpg"], "title": "Cinder (The Lunar Chronicles #1)", "description": "Humans and androids crowd the raucous streets of New Beijing. A deadly plague ravages the population. From space, a ruthless lunar people watch, waiting to make their move. No one knows that Earth’s fate hinges on one girl.Cinder, a gifted mechanic, is a cyborg. She’s a second-class citizen with a mysterious past, reviled by her stepmother and blamed for her stepsister’s i Humans and androids crowd the raucous streets of New Beijing. A deadly plague ravages the population. From space, a ruthless lunar people watch, waiting to make their move. No one knows that Earth’s fate hinges on one girl.Cinder, a gifted mechanic, is a cyborg. She’s a second-class citizen with a mysterious past, reviled by her stepmother and blamed for her stepsister’s illness. But when her life becomes intertwined with the handsome Prince Kai’s, she suddenly finds herself at the center of an intergalactic struggle, and a forbidden attraction. Caught between duty and freedom, loyalty and betrayal, she must uncover secrets about her past in order to protect her world’s future. ...more", "star_rating": 1, "upc": "7e9579921e5407cb", "product_type": "Books", "currency": "£", "price_exceltax": 26.09, "price_incltax": 26.09, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/civilization-and-its-discontents_140/index.html", "url_md5": "http://books.toscrape.com/catalogue/civilization-and-its-discontents_140/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/5c/27/5c2728296f41f2f0fb52142e35f49570.jpg"], "title": "Civilization and Its Discontents", "description": "It stands as a brilliant summary of the views on culture from a psychoanalytic perspective that he had been developing since the turn of the century. It is both witness and tribute to the late theory of mind—the so-called structural theory, with its stress on aggression, indeed the death drive, as the pitiless adversary of eros.Civilization and Its Discontents is one of th It stands as a brilliant summary of the views on culture from a psychoanalytic perspective that he had been developing since the turn of the century. It is both witness and tribute to the late theory of mind—the so-called structural theory, with its stress on aggression, indeed the death drive, as the pitiless adversary of eros.Civilization and Its Discontents is one of the last of Freud's books, written in the decade before his death and first published in German in 1929. In it he states his views on the broad question of man's place in the world, a place Freud defines in terms of ceaseless conflict between the individual's quest for freedom and society's demand for conformity.Freud's theme is that what works for civilization doesn't necessarily work for man. Man, by nature aggressive and egotistical, seeks self-satisfaction. But culture inhibits his instinctual drives. The result is a pervasive and familiar guilt.Of the various English translations of Freud's major works to appear in his lifetime, only one was authorized by Freud himself: The Standard Edition of the Complete Psychological Works of Sigmund Freud under the general editorship of James Strachey.Freud approved the overall editorial plan, specific renderings of key words and phrases, and the addition of valuable notes, from bibliographical and explanatory. Many of the translations were done by Strachey himself; the rest were prepared under his supervision. The result was to place the Standard Edition in a position of unquestioned supremacy over all other existing versions. ...more", "star_rating": 2, "upc": "396385e3de5d18c3", "product_type": "Books", "currency": "£", "price_exceltax": 59.95, "price_incltax": 59.95, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/and-then-there-were-none_119/index.html", "url_md5": "http://books.toscrape.com/catalogue/and-then-there-were-none_119/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/6f/b0/6fb0c3064656f888125ab577b6a01867.jpg"], "title": "And Then There Were None", "description": "First, there were ten - a curious assortment of strangers summoned as weekend guests to a private island off the coast of Devon. Their host, an eccentric millionaire unknown to all of them, is nowhere to be found. All that the guests have in common is a wicked past they're unwilling to reveal - and a secret that will seal their fate. For each has been marked for murder. On First, there were ten - a curious assortment of strangers summoned as weekend guests to a private island off the coast of Devon. Their host, an eccentric millionaire unknown to all of them, is nowhere to be found. All that the guests have in common is a wicked past they're unwilling to reveal - and a secret that will seal their fate. For each has been marked for murder. One by one they fall prey. Before the weekend is out, there will be none. And only the dead are above suspicion. ...more", "star_rating": 2, "upc": "cfe350b20d23b02b", "product_type": "Books", "currency": "£", "price_exceltax": 35.01, "price_incltax": 35.01, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/annie-on-my-mind_120/index.html", "url_md5": "http://books.toscrape.com/catalogue/annie-on-my-mind_120/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/78/2c/782c8d1e4ab324d978c5dadca02e8cd8.jpg"], "title": "Annie on My Mind", "description": "This groundbreaking book is the story of two teenage girls whose friendship blossoms into love and who, despite pressures from family and school that threaten their relationship, promise to be true to each other and their feelings. This book is so truthful and honest, it has been banned from many school libraries and even publicly burned in Kansas City.Of the author and th This groundbreaking book is the story of two teenage girls whose friendship blossoms into love and who, despite pressures from family and school that threaten their relationship, promise to be true to each other and their feelings. This book is so truthful and honest, it has been banned from many school libraries and even publicly burned in Kansas City. Of the author and the book, the Margaret A. Edwards Award committee said, “Nancy Garden has the distinction of being the first author for young adults to create a lesbian love story with a positive ending. Using a fluid, readable style, Garden opens a window through which readers can find courage to be true to themselves.” ...more", "star_rating": 5, "upc": "7bf87402413c27ff", "product_type": "Books", "currency": "£", "price_exceltax": 36.83, "price_incltax": 36.83, "tax": 0.0, "availability": 3, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/fruits-basket-vol-2-fruits-basket-2_100/index.html", "url_md5": "http://books.toscrape.com/catalogue/fruits-basket-vol-2-fruits-basket-2_100/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/87/36/8736be56d958f5d8d855108afb206c9f.jpg"], "title": "Fruits Basket, Vol. 2 (Fruits Basket #2)", "description": "A family with an ancient curse...And the girl who will change their lives forever...Ever since Tohru Honda discovered the Zodiac secret of the Sohma clan, her eyes have opened to a world of magic and wonder. But with such a great secret comes great responsibility. When her best friends Hana-chan and Uo-chan come to the Sohma home for a sleepover, Tohru has her work cut out A family with an ancient curse...And the girl who will change their lives forever...Ever since Tohru Honda discovered the Zodiac secret of the Sohma clan, her eyes have opened to a world of magic and wonder. But with such a great secret comes great responsibility. When her best friends Hana-chan and Uo-chan come to the Sohma home for a sleepover, Tohru has her work cut out for her keeping the \"Cat\" in the bag and the \"Dog\" on a leash. ...more", "star_rating": 5, "upc": "c0db71f6bb14db11", "product_type": "Books", "currency": "£", "price_exceltax": 11.64, "price_incltax": 11.64, "tax": 0.0, "availability": 2, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/diary-of-a-minecraft-zombie-book-1-a-scare-of-a-dare-an-unofficial-minecraft-book_99/index.html", "url_md5": "http://books.toscrape.com/catalogue/diary-of-a-minecraft-zombie-book-1-a-scare-of-a-dare-an-unofficial-minecraft-book_99/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/a8/9a/a89a1b7ffea60884f203877bb89f6ef4.jpg"], "title": "Diary of a Minecraft Zombie Book 1: A Scare of a Dare (An Unofficial Minecraft Book)", "description": "Diary of a Minecraft Zombie Has a Fresh New Look! Ever wonder what it would be like to be a Minecraft Zombie? In the first book of this hilarious Minecraft adventure series, we get to read the diary of an actual 12 year old, Minecraft Zombie. Take a peek at what is really going on between the hollow eyes, and dead expression that we normally see when we face the dreaded Z Diary of a Minecraft Zombie Has a Fresh New Look! Ever wonder what it would be like to be a Minecraft Zombie? In the first book of this hilarious Minecraft adventure series, we get to read the diary of an actual 12 year old, Minecraft Zombie. Take a peek at what is really going on between the hollow eyes, and dead expression that we normally see when we face the dreaded Zombies of Minecraft. Are Zombies really different from us? You'll be surprised at what you discover. So, jump into this Minecraft adventure and find out!. Diary of a Zombie is a must-read for any kid who loves Minecraft. Kids ages 7+ can't wait to jump into to these Minecraft adventures! Get Your Copy Today! ...more", "star_rating": 4, "upc": "d7b463918d3b8c39", "product_type": "Books", "currency": "£", "price_exceltax": 52.88, "price_incltax": 52.88, "tax": 0.0, "availability": 2, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-sandman-vol-1-preludes-and-nocturnes-the-sandman-volumes-1_79/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-sandman-vol-1-preludes-and-nocturnes-the-sandman-volumes-1_79/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/35/18/3518d80c6b73f9c76e9713af42b9c8e1.jpg"], "title": "The Sandman, Vol. 1: Preludes and Nocturnes (The Sandman (volumes) #1)", "description": "In 1916, Dream is captured and encased in a glass globe in a failed attempt by a fictional Edwardian magician (very much in the vein of Aleister Crowley) named Roderick Burgess to bind Death and attain immortality. Dream bides his time for decades until Burgess dies. Afterwards, his son Alexander becomes Dream's new captor. Finally, in 1988, Alex's guards grow careless and In 1916, Dream is captured and encased in a glass globe in a failed attempt by a fictional Edwardian magician (very much in the vein of Aleister Crowley) named Roderick Burgess to bind Death and attain immortality. Dream bides his time for decades until Burgess dies. Afterwards, his son Alexander becomes Dream's new captor. Finally, in 1988, Alex's guards grow careless and the guards watching him fall asleep in his presence, allowing Dream to use the sand from their dream to his benefit. When the guards awake and break the seal Dream was in, he is then able to escape. Dream punishes Alex by cursing him to experience an unending series of nightmares. The rest of the story concerns Dream's quest to recover his totems of power, which were dispersed following his capture: a pouch of sand, a helm and a ruby. The pouch is being kept by a former girlfriend of John Constantine's. Once that is recovered, Dream travels to hell to regain the helm from a demon, where he incurs the wrath of Lucifer (an enmity that will have major repercussions later in the series). The ruby is in the possession of John Dee, a.k.a. Doctor Destiny, a supervillain from the Justice League of America series. He has warped and corrupted the ruby, rendering Dream unable to use it, and with it he nearly tears apart the Dreaming. However, thinking that it will kill Dream, Dee shatters the ruby, inadvertently releasing the power that Dream had stored in the ruby and restoring Dream to his full power. The collection ends with \"The Sound of Her Wings\", an epilogue to the first story-arc. This issue introduces a character who has become one of the series' most popular and prominent personalities: Dream's older sister Death. She is depicted as an attractive, down-to-earth young goth girl, very unlike the traditional personification of death, and spends the issue talking Dream out of his brief post-quest depression. ...more", "star_rating": 3, "upc": "5faefdc861684eb1", "product_type": "Books", "currency": "£", "price_exceltax": 54.12, "price_incltax": 54.12, "tax": 0.0, "availability": 1, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-secret-healer_80/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-secret-healer_80/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/3e/59/3e59b2225c72d3dcf40a306e2b983314.jpg"], "title": "The Secret Healer", "description": "In the fourteenth century, opportunities for women are limited to the home. But spirited young Madlen finds her calling as assistant to the city’s trusted midwife, Clara. Working alongside Clara, Madlen develops a surprisingly soothing technique and quickly becomes a talented healer.After Clara’s tragic death, Madlen alone rushes to assist the birth of a local nobleman’s c In the fourteenth century, opportunities for women are limited to the home. But spirited young Madlen finds her calling as assistant to the city’s trusted midwife, Clara. Working alongside Clara, Madlen develops a surprisingly soothing technique and quickly becomes a talented healer.After Clara’s tragic death, Madlen alone rushes to assist the birth of a local nobleman’s child. But rather than the joy of birth, Madlen walks into an accusation of murder and witchcraft because of her extraordinary gifts. Forced to flee her own town, she establishes a new identity in the home of her aunt. Yet even though it endangers her life, she cannot resist the urge to help the sick patients who seek out her miraculous treatment. When she meets handsome Johannes—an investigator hired by the Church to bring her to justice for sacrilegious acts—she becomes drawn to the very man who could destroy her.Will Madlen’s gifts bring about her downfall? Or can love and reason prevail in a time of fearful superstition? ...more", "star_rating": 3, "upc": "38f776ab9118aed7", "product_type": "Books", "currency": "£", "price_exceltax": 34.56, "price_incltax": 34.56, "tax": 0.0, "availability": 1, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-bette-davis-club_59/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-bette-davis-club_59/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/fb/6c/fb6c914f1da870442031095c85f4cf80.jpg"], "title": "The Bette Davis Club", "description": "The morning of her niece’s wedding, Margo Just drinks a double martini and contemplates the many mistakes she’s made in her fifty-odd years of life. Spending three decades in love with a wonderful but unattainable man is pretty high up on her list of missteps, as is a long line of unsuccessful love affairs accompanied by a seemingly endless supply of delicious cocktails.Wh The morning of her niece’s wedding, Margo Just drinks a double martini and contemplates the many mistakes she’s made in her fifty-odd years of life. Spending three decades in love with a wonderful but unattainable man is pretty high up on her list of missteps, as is a long line of unsuccessful love affairs accompanied by a seemingly endless supply of delicious cocktails.When the young bride flees—taking with her a family heirloom and leaving behind six hundred bewildered guests—her mother offers Margo fifty grand to retrieve her spoiled brat of a daughter and the invaluable property she stole. So, together with the bride’s jilted and justifiably crabby fiancé, Margo sets out in a borrowed 1955 red MG on a cross-country chase. Along the way, none of what she discovers will be quite what she expected. But it might be exactly what she’s been seeking all along.From acclaimed humor writer Jane Lotter comes this madcap, laugh-out-loud adventure, The Bette Davis Club. Revised edition: This edition of The Bette Davis Club includes editorial revisions. ...more", "star_rating": 3, "upc": "dfb0849016bc122c", "product_type": "Books", "currency": "£", "price_exceltax": 30.66, "price_incltax": 30.66, "tax": 0.0, "availability": 1, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/the-bhagavad-gita_60/index.html", "url_md5": "http://books.toscrape.com/catalogue/the-bhagavad-gita_60/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/13/27/13270087ac5cba3e999166a64991187a.jpg"], "title": "The Bhagavad Gita", "description": "The Bhagavad Gita is an intensely spiritual work that forms the cornerstone of the Hindu faith, and is also one of the masterpieces of Sanskrit poetry. It describes how, at the beginning of a mighty battle between the Pandava and Kaurava armies, the god Krishna gives spiritual enlightenment to the warrior Arjuna, who realizes that the true battle is for his own soul.Juan M The Bhagavad Gita is an intensely spiritual work that forms the cornerstone of the Hindu faith, and is also one of the masterpieces of Sanskrit poetry. It describes how, at the beginning of a mighty battle between the Pandava and Kaurava armies, the god Krishna gives spiritual enlightenment to the warrior Arjuna, who realizes that the true battle is for his own soul.Juan Mascaró's translation of The Bhagavad Gita captures the extraordinary aural qualities of the original Sanskrit. This edition features a new introduction by Simon Brodbeck, which discusses concepts such as dehin, prakriti and karma. ...more", "star_rating": 3, "upc": "f3a0b8c835129558", "product_type": "Books", "currency": "£", "price_exceltax": 57.49, "price_incltax": 57.49, "tax": 0.0, "availability": 1, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/old-records-never-die-one-mans-quest-for-his-vinyl-and-his-past_39/index.html", "url_md5": "http://books.toscrape.com/catalogue/old-records-never-die-one-mans-quest-for-his-vinyl-and-his-past_39/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/aa/55/aa55bbf7037a0e19ae69485adcc11903.jpg"], "title": "Old Records Never Die: One Man's Quest for His Vinyl and His Past", "description": "Foreword by Wilco's Jeff Tweedy\"Memories are far more indelible when married to the physical world, and Spitznagel proves the point in this vivid book. We love vinyl records because they combine the tactile, the visual, the seeable effects of age and care and carelessless. When he searches for the records he lost and sold,Spitznagel istrying to return to a tangible past, a Foreword by Wilco's Jeff Tweedy\"Memories are far more indelible when married to the physical world, and Spitznagel proves the point in this vivid book. We love vinyl records because they combine the tactile, the visual, the seeable effects of age and care and carelessless. When he searches for the records he lost and sold, Spitznagel is trying to return to a tangible past, and he details that process with great sensitivity and impact.\"—Dave Eggers, author of The CircleHigh Fidelity meets Killing Yourself to Live in this memoir of one man's search for his lost record collection. As he finds himself within spitting distance of middle-age, journalist Eric Spitznagel feels acutely the loss of…something. Freedom? Maybe. Coolness? Could be. The records he sold in a financial pinch? Definitely. To find out for sure, he sets out on a quest to find  the original vinyl artifacts from his past. Not just copies. The exact same records: The Bon Jovi record with his first girlfriend's phone number scrawled on the front sleeve. The KISS Alive II he once shared with his little brother. The Replacements Let It Be he’s pretty sure, 20 years later, would still smell like weed. As he embarks on his hero's journey, he reminisces about the actual records, the music, and the people he listened to it with—old girlfriends, his high school pals, and, most poignantly, his father and his young son. He explores the magic of music and memory as he interweaves his adventures in record- culture with questions about our connection to our past, whether we can ever recapture it, and whether we would want to if we could. ...more", "star_rating": 2, "upc": "a1985630339f4b3d", "product_type": "Books", "currency": "£", "price_exceltax": 55.66, "price_incltax": 55.66, "tax": 0.0, "availability": 1, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/on-the-road-duluoz-legend_40/index.html", "url_md5": "http://books.toscrape.com/catalogue/on-the-road-duluoz-legend_40/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/7f/9b/7f9bc0563de554998e2d93b7edec4921.jpg"], "title": "On the Road (Duluoz Legend)", "description": "On the Road chronicles Jack Kerouac's years traveling the North American continent with his friend Neal Cassady, \"a sideburned hero of the snowy West.\" As \"Sal Paradise\" and \"Dean Moriarty,\" the two roam the country in a quest for self-knowledge and experience. Kerouac's love of America, his compassion for humanity, and his sense of language as jazz combine to make On the On the Road chronicles Jack Kerouac's years traveling the North American continent with his friend Neal Cassady, \"a sideburned hero of the snowy West.\" As \"Sal Paradise\" and \"Dean Moriarty,\" the two roam the country in a quest for self-knowledge and experience. Kerouac's love of America, his compassion for humanity, and his sense of language as jazz combine to make On the Road an inspirational work of lasting importance.Kerouac's classic novel of freedom and longing defined what it meant to be \"Beat\" and has inspired every generation since its initial publication. ...more", "star_rating": 3, "upc": "9ff997ab15713e53", "product_type": "Books", "currency": "£", "price_exceltax": 32.36, "price_incltax": 32.36, "tax": 0.0, "availability": 1, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/frankenstein_20/index.html", "url_md5": "http://books.toscrape.com/catalogue/frankenstein_20/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/f7/22/f722c24607ddc8013476ca8e84639ba7.jpg"], "title": "Frankenstein", "description": "Mary Shelley began writing Frankenstein when she was only eighteen. At once a Gothic thriller, a passionate romance, and a cautionary tale about the dangers of science, Frankenstein tells the story of committed science student Victor Frankenstein. Obsessed with discovering the cause of generation and life and bestowing animation upon lifeless matter, Frankenstein assembles Mary Shelley began writing Frankenstein when she was only eighteen. At once a Gothic thriller, a passionate romance, and a cautionary tale about the dangers of science, Frankenstein tells the story of committed science student Victor Frankenstein. Obsessed with discovering the cause of generation and life and bestowing animation upon lifeless matter, Frankenstein assembles a human being from stolen body parts but; upon bringing it to life, he recoils in horror at the creature's hideousness. Tormented by isolation and loneliness, the once-innocent creature turns to evil and unleashes a campaign of murderous revenge against his creator, Frankenstein.Frankenstein, an instant bestseller and an important ancestor of both the horror and science fiction genres, not only tells a terrifying story, but also raises profound, disturbing questions about the very nature of life and the place of humankind within the cosmos: What does it mean to be human? What responsibilities do we have to each other? How far can we go in tampering with Nature? In our age, filled with news of organ donation genetic engineering, and bio-terrorism, these questions are more relevant than ever. ...more", "star_rating": 2, "upc": "a492f49a3e2b6a71", "product_type": "Books", "currency": "£", "price_exceltax": 38.0, "price_incltax": 38.0, "tax": 0.0, "availability": 1, "n_reviews": 0},{"url": "http://books.toscrape.com/catalogue/forever-rockers-the-rocker-12_19/index.html", "url_md5": "http://books.toscrape.com/catalogue/forever-rockers-the-rocker-12_19/index.html", "process_date": "2019-08-12", "img_url": ["http://books.toscrape.com/media/cache/a2/fc/a2fc91793502f5c10b5826ad606de435.jpg"], "title": "Forever Rockers (The Rocker #12)", "description": "My Happily Ever After was turning into a living nightmare... All I wanted was Harper's happiness and I would move the world to give her anything she ever wanted. We've searched for answers, talked about our options, and finally-FINALLY-found hope. Yet, just when things seemed to be perfect, it all came crashing down around us all. The one person I've always counted on to h My Happily Ever After was turning into a living nightmare... All I wanted was Harper's happiness and I would move the world to give her anything she ever wanted. We've searched for answers, talked about our options, and finally-FINALLY-found hope. Yet, just when things seemed to be perfect, it all came crashing down around us all. The one person I've always counted on to hold us together-to hold me together-was lost in her own nightmares and I felt like I was losing everything. Everything. I wasn't going to lose the woman I loved. I would hold onto her until the last breath left my body. It was my mistakes that were hurting us and I would be the one to fix it. I wouldn't let my past ruin my forever with Harper. ...more", "star_rating": 3, "upc": "e564c3f1a93ccf2e", "product_type": "Books", "currency": "£", "price_exceltax": 28.8, "price_incltax": 28.8, "tax": 0.0, "availability": 1, "n_reviews": 0}]